[{"title":"Mac & Cheese","description":"Lauren Miyashiro is the Food Director for Delish.com.","cookingTime":"60-120","totalTime":"60","quantity":"8 - 10","ingredients":"1 lb. elbow macaroni\n1/2 c. (1 stick) melted butter\n4 c. shredded cheddar cheese\n4 oz. cream cheese, cut into cubes\n1/2 c. freshly grated grated Parmesan\n2 (12-oz.) cans evaporated milk\n2 c. whole milk\n1/2 tsp. garlic powder\n1/8 tsp. paprika\nkosher salt\nFreshly ground black pepper\nFinely chopped chives, for garnish (optional)","instructions":"Combine macaroni, butter, cheddar cheese, cream cheese, Parmesan, evaporated milk, whole milk, garlic powder, and paprika in a slow cooker. Season with salt and pepper.\n\nCook on high until the pasta is cooked through and the sauce has thickened, 2 to 3 hours, checking after 2 hours, then every 20 minutes after.\n\nGarnish with chives before serving, if using. ","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/03023121-3749-4c97-8f2c-c95b71f8aaa3.png"],"url":"https://www.delish.com/cooking/recipe-ideas/recipes/a51531/slow-cooker-mac-cheese-recipe/","favorite":false,"rating":0.0,"lastModifiedDate":"2020-10-10 08:35:46","uuid":-2025342389,"originalPicture":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/delish-crock-pot-macaroni-and-cheese-horizontal-1539898014.jpg?crop=1xw:0.75xh;center,top&resize=1200:*","categories":[{"title":"Entree"}],"tags":[{"title":"vegetarian"},{"title":"Italian"},{"title":"milk protein"},{"title":"American"}],"keywords":"vegetarian;Italian;milk protein;American"},{"title":"Vegetarian Moussaka","description":"Makinze is the Associate Food Editor for Delish.com.","preparationTime":"15 mins","cookingTime":"90 mins","totalTime":"105","quantity":"6 servings","ingredients":"2 medium eggplants, sliced into 1/2\" rounds\nKosher salt\n4 tbsp. extra-virgin olive oil, divided\n1 medium yellow onion, chopped\n8-oz. baby bellas, sliced\n3 cloves garlic, minced\n1 c. green lentils\n1 (14.5-oz.) can diced tomatoes\n2 c. water\n1 tsp. dried oregano\nFreshly ground black pepper\n2 tbsp. butter\n2 tbsp. all-purpose flour\n2 c. milk\n3/4 c. freshly grated Parmesan, divided \n2 large egg yolks ","instructions":"Preheat oven to 400°. In a single layer, lay eggplant rounds out on paper towel-lined baking sheets. Sprinkle salt on both sides of eggplant. Let sit 10 minutes, then pat dry with paper towels. \n\nBrush eggplants with 2 tablespoons oil and place on baking sheets in a single layer. Bake until tender, 12 minutes. \n\nIn a large pot over medium heat, heat remaining 2 tablespoons oil. Add onion and mushrooms and cook until tender, 5 minutes. Add garlic and cook until fragrant, 1 minute more. Add lentils, tomatoes, and water. Season with oregano, salt, and pepper. Simmer until lentils are tender, 30 minutes. Add more water as necessary if sauce looks too thick. \n\nIn a medium pot over medium heat, melt butter. Whisk in flour and cook 1 minute. Slowly pour in milk, whisking until no lumps remain. Cook until thickened, about 5 minutes, then add in Parmesan and stir until melted. \n\nPlace yolks in a small bowl and lightly beat. Add about 2 tablespoons of bechamel and whisk to combine, then pour mixture back into bechamel and whisk until combined. Season with salt and pepper. Let simmer until thickened, about 5 minutes more. \n\nIn a 9”-x-13” baking dish, place a single layer of eggplants. Add half of the lentil mixture, then repeat with more eggplant and the rest of the lentils. Top with a final layer of eggplants. Spoon bechamel over eggplant and top with remaining ¼ cup of Parmesan.  \n\nBake until top is golden and heated through, 30 minutes. ","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/3806afe4-30aa-46ec-b847-c4270a73d9c9.png"],"url":"https://www.delish.com/cooking/recipe-ideas/a30876085/vegetarian-moussaka-recipe/","favorite":false,"rating":0.0,"lastModifiedDate":"2020-10-10 08:36:16","uuid":1252643390,"originalPicture":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/delish-202002-vegetarian-moussaka-landscape-1-pf-1582302118.jpg?crop=1.00xw:0.752xh;0,0.0793xh&resize=1200:*","categories":[{"title":"Entree"}],"tags":[{"title":"plant protein"},{"title":"vegetarian"},{"title":"Mediterranean"},{"title":"Greek"},{"title":"milk protein"}],"keywords":"plant protein;vegetarian;Mediterranean;Greek;milk protein"},{"title":"Spicy Sweet Potato and Green Rice Burrito Bowls","description":"Healthy burrito bowls made with roasted sweet potato, green rice and black beans! This delicious, vegan dinner reheats well for lunch. Recipe yields 4 servings.","preparationTime":"20","cookingTime":"45","totalTime":"65","quantity":"4","ingredients":"3 tablespoons extra-virgin olive oil\n1 1/2 cups long grain brown rice\n3 cups vegetable broth\n1 1/2 cup baby spinach, lightly packed\n1/2 cup cilantro (mostly leaves, stems are ok), lightly packed\n1 jalapeño or serrano pepper, seeded, membranes removed and roughly chopped\n1 medium shallot, peeled and roughly chopped\n1 garlic clove, peeled, roughly chopped\n1/4 teaspoon salt, more to taste\n2 pounds sweet potatoes (3 to 4 medium sweet potatoes), peeled and sliced into 1-inch chunks\n2 tablespoons olive oil\n1/2 teaspoon smoked paprika\n1/4 teaspoon sea salt\n2 cans (14 ounces each) black beans or 3 cups cooked black beans, with their cooking liquid\n2 teaspoons ground cumin\n1/2 teaspoon chili powder\n1 teaspoon sherry vinegar or lime juice\nSea salt and freshly ground black pepper, to taste\n1/4 cup pepitas (green pumpkin seeds)\n1/4 teaspoon olive oil\n1 avocado, pitted and sliced\nJarred mild salsa verde\nChopped cilantro\nCrumbled feta (optional, not vegan)","instructions":"Preheat oven to 425 degrees Fahrenheit. Line one large, rimmed baking sheet and one smaller sheet with parchment paper. Place the spinach, cilantro, jalapeño, shallot, garlic, salt and 1/2 cup of the vegetable broth in a food processor or blender. Blend until smooth.\n\nHeat the oil in a heavy-bottomed pot over medium heat until shimmering. Add the rice and stir to coat. Spread the rice in an even layer on the bottom of the pot and let the rice lightly brown. This happens quickly! When the rice starts to brown, stir it and spread it out in an even layer again so that more of the rice browns.\n\nWhen most of the rice has lightly browned, scrape the green purée into the rice. Stir until the rice is evenly coated with green purée and continue to cook, stirring constantly, for a minute. Add the rest of the vegetable broth to the pot. Bring to a boil, then reduce the heat to a low simmer and cover the pot. Cook the rice on a very low simmer until tender, 35 to 40 minutes.\n\nWhile the rice cooks, toss the sweet potatoes in the olive oil, smoked paprika and salt until the sweet potatoes are evenly coated in oil. Arrange in a single layer on your prepared baking sheet. Bake for 35 to 40 minutes, tossing halfway, until the sweet potatoes are tender and caramelizing at the edges.\n\nMeanwhile, transfer the beans and their cooking liquid (don’t drain the beans) to a medium pot. Stir in the cumin and chili powder and warm over medium heat. Once the beans are simmering, cover the beans and reduce heat to maintain a very gentle simmer until you’re ready to serve.\n\nOnce the rice is done cooking, remove the pot from heat. Uncover the pot and place a clean tea towel over the pot, then recover. The towel will help absorb excess liquid as the rice continues to cook in its own steam. (If you don’t have a clean towel, you can skip this step, just cover normally.) Let sit for 10 minutes.\n\nOnce the sweet potatoes are done cooking, toss the pepitas with 1/4 teaspoon olive oil and a sprinkle of salt on the small baking sheet. Toast the seeds in the oven for 4 to 5 minutes, until they’re turning lightly golden and making little popping noises. Set aside to cool.\n\nFluff the rice with a fork and season with salt if necessary. Remove beans from heat, stir in the vinegar and season to taste with salt and pepper.\n\nAssemble your bowls: First add green rice, then use a slotted spoon or fork to transfer beans to the bowls. Top with sweet potatoes and add a few slices of avocado to each bowl. Sprinkle with toasted pepitas and cilantro and optional feta. Serve with salsa verde on the side.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/76953acb-457f-4d51-820a-b1f1f7d778ac.png"],"url":"https://cookieandkate.com/vegan-sweet-potato-green-rice-burrito-bowls/","favorite":false,"rating":0.0,"lastModifiedDate":"2020-10-01 20:32:09","uuid":-1075578715,"originalPicture":"https://cookieandkate.com/images/2015/01/simple-sweet-potato-green-rice-burrito-bowls-2-225x225.jpg","categories":[{"title":"Entree"}],"tags":[{"title":"plant protein"},{"title":"vegan"},{"title":"bowl"}],"keywords":"plant protein;vegan;bowl"},{"title":"Lentil Baked Ziti","description":"This healthy vegetarian baked ziti recipe includes lentils for protein. It’s a delicious dinner that makes great leftovers. Be sure to serve it with a big green side salad; my Italian chopped salad or a pared-down version of it would be perfect. Recipe yields 6 to 8 servings.","preparationTime":"20","cookingTime":"65","totalTime":"85","quantity":"6","ingredients":"1 tablespoon olive oil\n1 red onion, chopped\n1/4 teaspoon salt\n2 cloves garlic, pressed or minced\n1 1/4 cups regular brown lentils, picked over for debris and rinsed\n3 cups water\n12 ounces whole grain ziti, rigatoni or penne pasta\n8 ounces (2 packed cups) grated part-skim mozzarella cheese, divided\nSalt, to taste\nFreshly ground black pepper, to taste\nPinch of red pepper flakes (omit if sensitive to spice)\n23.5 ounces Newman’s Own Organics Marinara (plus 1 cup extra sauce, if you like extra-saucy ziti like me), divided\n1 cup cottage cheese or ricotta cheese**\nHandful of torn fresh basil leaves, for garnishing","instructions":"To cook the lentils: In a large saucepan over medium heat, warm the olive oil until shimmering. Add the onion and salt. Cook, stirring occasionally, until the onion is turning translucent, about 4 to 5 minutes. Add the garlic and cook until fragrant, about 30 seconds. Add the lentils and water, and stir to combine.\n\nRaise the heat to high and bring the mixture to a simmer, then reduce heat to medium-low and gently simmer until the lentils are tender and cooked through, about 30 to 40 minutes. Drain the mixture well in a fine-mesh sieve and return the lentils to their pot. Set aside.\n\nMeanwhile, preheat the oven to 350 degrees Fahrenheit and bring a large pot of salted water to boil. Cook the pasta just until al dente, according to package directions. Drain and return the pasta to the pot.\n\nAdd the lentils to the pasta. Add 1/2 cup of the cheese, reserving the rest for later. Season to taste with salt (I usually add 1/4 to 1/2 teaspoon), freshly ground black pepper and red pepper flakes (if using).\n\nPour 1 cup of the marinara sauce into a 13×9-inch baking dish. Spread the sauce around with a spatula so the base of the baker is evenly coated. Pour the lentil and pasta mixture into the baker and spread it so it’s evenly distributed. Using a spoon, dollop cottage cheese in big spoonfuls over the pasta, then just lightly swirl the mixture a bit so the cottage cheese is still concentrated in those areas.\n\nDrizzle the rest of the sauce evenly over the dish (adding extra sauce if you’d like) and gently spread it over the pasta. Sprinkle the remaining mozzarella evenly over the dish. Cover the baker tightly with aluminum foil—don’t let it touch the cheese—or stick a few wooden toothpicks down the center and place a generously sized piece of parchment paper, folded in the middle to make a “tent” over the baker.\n\nBake for 30 minutes, then remove the covering, increase the heat to 450, and continue baking until the cheese on top is golden and spotty, 3 to 9 more minutes. Remove the baker from the oven and let it cool for 10 minutes before serving (trust me). Sprinkle freshly torn basil on top, slice and serve.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/026a1ab7-14e8-4064-a662-c8ffa54488bc.png"],"url":"https://cookieandkate.com/lentil-baked-ziti-recipe/","favorite":false,"rating":0.0,"lastModifiedDate":"2020-10-01 20:33:41","uuid":1365797711,"originalPicture":"https://cookieandkate.com/images/2017/01/vegetarian-baked-ziti-recipe-225x225.jpg","categories":[{"title":"Entree"}],"tags":[{"title":"plant protein"},{"title":"vegetarian"},{"title":"Italian"},{"title":"milk protein"}],"keywords":"plant protein;vegetarian;Italian;milk protein"},{"title":"Mulan Congee","preparationTime":"5","cookingTime":"20","totalTime":"25","quantity":"2-3 servings","ingredients":"[RICE]\n1 cup rice\n2 cups chicken stock\n1 tbsp ginger-garlic paste\n1 small onion, diced\n\n[TOPPINGS]\nbacon, 1-2 per bowl -> Alex prefers softer bacon & Ariel may prefer no bacon &/ second egg\neggs, 1 per bowl\n\n[SEASONING]\n1 tbsp rice vinegar\n0.5 tsp oil","instructions":"[RICE]\nIn large pot, saute diced onion and ginger-garlic paste. Add rice and chicken stock. Bring to a boil and cook until creamy. Then add in SEASONING.\n\n[TOPPINGS]\nMeanwhile, in a medium pan, cook the bacon. \nIn a small pan, cook the eggs with a lid over the top (sunny-side eggs); yolk should be mostly liquid.\n\nAssemble bowl with bacon for the mouth and egg for the eye(s).","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/0af0c7f2-3148-432c-93ab-56c611daa42d.png"],"url":"https://rosannapansino.com/blogs/recipes/mulan-rice-porridge","favorite":false,"rating":3.5,"lastModifiedDate":"2020-10-25 08:55:49","uuid":982422906,"originalPicture":"http://cdn.shopify.com/s/files/1/0163/5948/9636/articles/Mulan_Rice_Porridge_thumbnail_1_1_grande.jpg?v=1599242041","categories":[{"title":"Breakfast"}],"tags":[{"title":"Asian"},{"title":"Chinese"}],"keywords":"Asian;Chinese"},{"title":"Müsli","preparationTime":"5","totalTime":"5","ingredients":"[Ariel portion]\n\n45 g various assembled Müsli\n140 g milk\n\n[Alex portion]\n\n70 g various assembled Müsli\n180 g milk","instructions":"Assemble and mix Müsli.\n\nAdd milk. Do not overfill. Can substitute yogurt for (part of) milk.\n\nMix in or top with chocolate powder and/or chips.\n\nTop with yogurt and fruits and anything else ;).","favorite":false,"rating":0.0,"lastModifiedDate":"2020-10-25 19:45:42","uuid":-29327232,"categories":[{"title":"Breakfast"}],"tags":[{"title":"milk protein"},{"title":"bowl"}],"keywords":"milk protein;bowl"},{"title":" Lentil Soup","description":"This simple vegan lentil soup recipe comes together quickly with mostly pantry ingredients. Be sure to have your ingredients prepped and ready before you start cooking! Recipe yields four large bowls of soup, or six more modest servings.","preparationTime":"10","cookingTime":"45","totalTime":"55","quantity":"4","ingredients":"1/4 cup extra virgin olive oil\n1 medium yellow or white onion, chopped\n2 carrots, peeled and chopped\n4 garlic cloves, pressed or minced\n2 teaspoons ground cumin\n1 teaspoon curry powder\n1/2 teaspoon dried thyme\n1 large can (28 ounces) diced tomatoes, lightly drained\n1 cup brown or green lentils, picked over and rinsed\n4 cups vegetable broth\n2 cups water\n1 teaspoon salt, more to taste\nPinch of red pepper flakes\nFreshly ground black pepper, to taste\n1 cup chopped fresh collard greens or kale, tough ribs removed\n1 to 2 tablespoons lemon juice (1/2 to 1 medium lemon), to taste","instructions":"Warm the olive oil in a large Dutch oven or pot over medium heat. One-fourth cup olive oil may seem like a lot, but it adds a lovely richness and heartiness to this nutritious soup.\n\nOnce the oil is shimmering, add the chopped onion and carrot and cook, stirring often, until the onion has softened and is turning translucent, about 5 minutes.\n\nAdd the garlic, cumin, curry powder and thyme. Cook until fragrant while stirring constantly, about 30 seconds. Pour in the drained diced tomatoes and cook for a few more minutes, stirring often, in order to enhance their flavor.\n\nPour in the lentils, broth and the water. Add 1 teaspoon salt and a pinch of red pepper flakes. Season generously with freshly ground black pepper. Raise heat and bring the mixture to a boil, then partially cover the pot and reduce the heat to maintain a gentle simmer. Cook for 25 to 30 minutes, or until the lentils are tender but still hold their shape.\n\nTransfer 2 cups of the soup to a blender. Securely fasten the lid, protect your hand from steam with a tea towel placed over the lid, and purée the soup until smooth. Pour the puréed soup back into the pot. (Or, use an immersion blender to blend a portion of the soup.)\n\nAdd the chopped greens and cook for 5 more minutes, or until the greens have softened to your liking. Remove the pot from the heat and stir in 1 tablespoon of lemon juice. Taste and season with more salt, pepper and/or lemon juice until the flavors really sing. For spicier soup, add another pinch or two of red pepper flakes.\n\nServe while hot. Leftovers will keep well for about 4 days in the refrigerator, or can be frozen for several months (just defrost before serving).","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/3d80e098-b56a-428b-bab5-6e66a30036a3.png"],"url":"https://cookieandkate.com/best-lentil-soup-recipe/#tasty-recipes-23764","nutrition":"calories : 367\nsugar : 10.8 g\nsodium : 1375.5 mg\nfat : 15.5 g\nsaturatedFat : 2.2 g\ntransFat : 0 g\ncarbohydrate : 47.8 g\nfiber : 10.8 g\nprotein : 14.5 g\ncholesterol : 0 mg","favorite":false,"rating":0.0,"lastModifiedDate":"2020-10-25 21:44:20","uuid":1467997889,"originalPicture":"https://cookieandkate.com/images/2019/01/best-lentil-soup-recipe-4-225x225.jpg","categories":[{"title":"Entree"},{"title":"Soup"}],"tags":[{"title":"plant protein"},{"title":"vegan"}],"keywords":"plant protein;vegan"},{"title":"Extra Vegetable Fried Rice","description":"Learn how to make vegetable fried rice—it's a simple and satisfying dinner! This vegetarian recipe features extra vegetables and brown rice. Recipe yields 2 large or 3 moderate servings (I think you could double it if you have a large enough skillet, but you might not get as much caramelization on the edges of the veggies and rice).","preparationTime":"20","cookingTime":"15","totalTime":"35","quantity":"2","ingredients":"1 1/2 teaspoons + 2 tablespoons avocado oil or safflower oil, divided\n2 eggs, whisked together\n1 small white onion, finely chopped (about 1 cup)\n2 medium carrots, finely chopped (about 1/2 cup)\n2 cups additional veggies, cut into very small pieces for quick cooking (see photos for size reference; options include snow peas, asparagus, broccoli, cabbage, bell pepper, and/or fresh or frozen peas—no need to thaw first)\n1/4 teaspoon salt, more to taste\n1 tablespoon grated or finely minced fresh ginger\n2 large cloves garlic, pressed or minced\nPinch of red pepper flakes\n2 cups cooked brown rice (*see notes!)\n1 cup greens (optional), such as spinach, baby kale or tatsoi\n3 green onions, chopped\n1 tablespoon reduced-sodium tamari or soy sauce**\n1 teaspoon toasted sesame oil\nChili-garlic sauce or sriracha, for serving (optional)","instructions":"This recipe comes together quickly. Before you get started, make sure that all of your ingredients are prepped and within an arm’s reach from the stove. Also have an empty bowl nearby for holding the cooked eggs and veggies. I’m suggesting that you start over medium-high heat, but if at any point you catch a whiff of oil or food burning, reduce the heat to medium.\n\nWarm a large cast iron or stainless steel skillet over medium-high heat until a few drops of water evaporate within a couple of seconds. Immediately add 1 1/2 teaspoons of oil and swirl the pan to coat the bottom. Add the scrambled eggs and swirl the pan so they cover the bottom. Cook until they are just lightly set, flipping or stirring along the way. Transfer the eggs to a bowl and wipe out the pan with a heat-proof spatula.\n\nReturn the pan to heat and add 1 tablespoon of oil. Add the onion and carrots and cook, stirring often, until the onions are translucent and the carrots are tender, about 3 to 5 minutes.\n\nAdd the remaining veggies and salt. Continue cooking, stirring occasionally (don’t stir too often, or the veggies won’t have a chance to turn golden on the edges), until the veggies are cooked through and turning golden, about 3 to 5 more minutes. In the meantime, use the edge of your spatula or a spoon to break up the scrambled eggs into smaller pieces.\n\nUse a big spatula or spoon to transfer the contents of the pan to the bowl with the cooked eggs. Return the pan to heat and the remaining 1 tablespoon oil. Add the ginger, garlic and red pepper flakes, and cook until fragrant while stirring constantly, about 30 seconds. Add the rice and mix it all together. Cook, stirring occasionally, until the rice is hot and starting to turn golden on the edges, about 3 to 5 minutes.\n\nAdd the greens (if using) and green onions, and stir to combine. Add the cooked veggies and eggs and stir to combine. Remove the pan from the heat and stir in the tamari and sesame oil. Taste, and add a little more tamari if you’d like more soy flavor (don’t overdo it or it will drown out the other flavors) or salt, if the dish needs an extra boost of overall flavor.\n\nDivide into bowls and serve immediately. I usually serve mine with chili-garlic sauce or sriracha on the side. Leftovers store well in the refrigerator, covered, for 3 to 4 days (if you used purple cabbage, it might stain your scrambled eggs a funny blue color, but it’s fine to eat).","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/eef012e4-1914-41aa-bf4c-b4753801a0d4.png"],"url":"https://cookieandkate.com/vegetable-fried-rice-recipe/#tasty-recipes-24427","nutrition":"calories : 400\nsugar : 24.9 g\nsodium : 1289.5 mg\nfat : 16.9 g\nsaturatedFat : 2.9 g\ntransFat : 0 g\ncarbohydrate : 54.4 g\nfiber : 11.6 g\nprotein : 11.5 g\ncholesterol : 124 mg","favorite":false,"rating":0.0,"lastModifiedDate":"2020-10-25 21:45:56","uuid":641490013,"originalPicture":"https://cookieandkate.com/images/2017/05/vegetable-fried-rice-225x225.jpg","categories":[{"title":"Side"}],"tags":[{"title":"veggies"},{"title":"Asian"},{"title":"starch"}],"keywords":"veggies;Asian;starch"},{"title":"French Dip","preparationTime":"0 hours 10 mins","totalTime":"1 hour 0 mins","quantity":"4","ingredients":"3 boneless (ribeye) steaks (about 3 pounds)\n1 tbsp. extra-virgin olive oil\n1 tbsp. kosher salt\n2 tsp. freshly ground black pepper\n2 tsp. dried oregano\n1 tsp. dried ground sage\n1/4 yellow onion, thinly sliced\n2 cloves garlic, minced\n2 tsp. minced fresh thyme\n1 1/2 c. low-sodium beef stock\n2 tsp. Worcestershire sauce\n6 hoagie rolls\n12 slices provolone","instructions":"Preheat oven to 450°. Rub beef all over with olive oil and place in roasting pan. In a small bowl, stir together salt, pepper, oregano, and sage.  Rub spice mix all over beef. Roast for 20 minutes or until a meat thermometer registers 125° in the thickest part of the ribeye. Set aside on a cutting board to rest and turn oven down to 350°.\n\nMeanwhile, make jus: Place roasting pan (with beef drippings) over stove top burner and turn to medium heat. Add onion and cook until soft, 3 minutes. Add garlic and thyme and cook until fragrant, 1 minute longer. Add beef broth and Worcestershire sauce and bring up to a simmer. Cook until thickened slightly, 8 to 10 minutes more.\n\nWhen ready to serve, thinly slice beef. Fill each roll with beef and top with provolone. Bake until cheese is melty, 10 minutes. \n\nServe with jus on the side for dipping.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/e102b874-e2f3-4761-8368-084598182d53.png"],"url":"https://www.delish.com/cooking/recipe-ideas/a26147072/french-dip-recipe/","favorite":false,"rating":3.5,"lastModifiedDate":"2020-11-29 17:19:00","uuid":864758424,"originalPicture":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/french-dip-511-copy-1550607214.jpg?crop=1.00xw:0.752xh;0,0.209xh&resize=1200:*","categories":[{"title":"Entree"},{"title":"Sandwich"}],"tags":[{"title":"beef"},{"title":"French"}],"keywords":"beef;French"},{"title":"Salmon with Sweet and Spicy Rub","preparationTime":"10 mins","cookingTime":"7 mins","totalTime":"17","quantity":"6","ingredients":"2 tablespoons packed light brown sugar\n1 tablespoon chilli powder\n1 teaspoon ground cumin\n1/8 teaspoon salt\n1/8 teaspoon freshly ground black pepper\n6 (6-ounce) salmon fillets, skin and any pin bones removed\n1 tablespoon olive oil\nCooking spray","instructions":"Coat your grill or a grill pan with cooking spray and preheat over medium heat. While the grill is heating, combine the brown sugar, chili powder, cumin, salt, and pepper. Brush each salmon fillet with 1/2 teaspoon of the oil, then rub each fillet with about 1/2 tablespoon of the spice mixture.\nGrill the salmon, flesh side down, until charred, 4 to 5 minutes. Flip the salmon and cook another 5 to 6 minutes for medium doneness. For well done fish, cook an additional 1 to 2 minutes. Remove to a platter and serve immediately.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/e9bb5412-8d6f-4989-973f-13376000a8f5.png"],"url":"https://foodnetwork.co.uk/recipes/salmon-with-sweet-and-spicy-rub/","favorite":false,"rating":0.0,"lastModifiedDate":"2020-10-28 19:06:47","uuid":684884211,"originalPicture":"https://d2v9mhsiek5lbq.cloudfront.net/eyJidWNrZXQiOiJsb21hLW1lZGlhLXVrIiwia2V5IjoiZm9vZG5ldHdvcmstaW1hZ2UtNTY3NzA3NzItZTBlNi00YzFjLTg2OGMtMDQxODZjNjg4NDJjLmpwZWciLCJlZGl0cyI6eyJyZXNpemUiOnsid2lkdGgiOjE5MjAsImhlaWdodCI6MTA4MCwiZml0IjoiY292ZXIifX19","categories":[{"title":"Entree"}],"tags":[{"title":"seafood"}],"keywords":"seafood"},{"title":"Cajun Blackened Salmon Recipe by Tasty","description":"Here's what you need: olive oil, salmon fillets, paprika, dried oregano, dried thyme, cayenne pepper, brown sugar, salt, pepper, avocados, mango, red onion, red chili, fresh parsley, salt, pepper, olive oil, lime juice","quantity":"4 servings","ingredients":"1 tablespoon olive oil\n4 salmon fillets\n2 tablespoons paprika\n1 tablespoon dried oregano\n1 tablespoon dried thyme\n1 teaspoon cayenne pepper\n1 tablespoon brown sugar\n1 teaspoon salt\n1 teaspoon pepper\n2 avocados, diced\n1 mango, diced\n1 red onion, finely diced\n1 red chili, finely diced\n¾ cup fresh parsley\nsalt, to taste\npepper, to taste\n2 tablespoons olive oil\n2 tablespoons lime juice","instructions":"In a small bowl, combine all the Cajun spice rub ingredients and stir.\n\nPlace the salmon fillets on a cutting board and rub the olive oil over all sides of the salmon fillets.\n\nSprinkle the spice rub over the salmon, using your hands to ensure all sides are covered.\n\nCook on a BBQ over a medium to high heat for 2 minutes per side. The outside should start to blacken and crisp, leaving the salmon juicy inside.\n\nOnce the salmon is cooked set aside.\n\nIn a large bowl, add all of the salsa ingredients and stir well.\n\nServe the salmon with an extra sprinkling of parsley alongside the salsa.\n\nEnjoy!","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/37206745-2dd4-40ea-9782-fc9c84f68254.png"],"url":"https://tasty.co/recipe/cajun-blackened-salmon","nutrition":"calories : 566 calories\ncarbohydrate : 28 grams\nfat : 38 grams\nfiber : 9 grams\nprotein : 28 grams\nsugar : 15 grams","favorite":false,"rating":0.0,"lastModifiedDate":"2020-10-28 19:08:11","uuid":1959131265,"originalPicture":"https://img.buzzfeed.com/thumbnailer-prod-us-east-1/77ea757e07524e53894766382587ac9d/Final_FaceBook_Salmon_-_Tasty_-_Facebook_-_1080x1080_Copy_04.jpg","categories":[{"title":"Entree"}],"tags":[{"title":"seafood"}],"keywords":"seafood"},{"title":"Asian Salmon in Foil - Damn Delicious","description":"The best and easiest way to make salmon in foil – and you won’t believe how much flavor is packed right in!","preparationTime":"10 minutes","cookingTime":"20 minutes","totalTime":"30","quantity":"4 servings","ingredients":"1/4 cup honey\n3 cloves garlic, minced\n2 tablespoons reduced sodium soy sauce\n1 tablespoon seasoned rice vinegar\n1 tablespoon sesame oil\n1 tablespoon freshly grated ginger\n1 teaspoon Sriracha, optional\nFreshly ground black pepper, to taste\n2 pounds salmon\n2 green onions, thinly sliced\n1/2 teaspoon sesame seeds","instructions":"Preheat oven to 375 degrees F. Line a baking sheet with foil.\n\nIn a small bowl, whisk together honey, garlic, soy sauce, rice vinegar, sesame oil, ginger, Sriracha and pepper, to taste.\n\nPlace salmon onto the prepared baking sheet and fold up all 4 sides of the foil. Spoon the honey mixture over the salmon. Fold the sides of the foil over the salmon, covering completely and sealing the packet closed.\n\nPlace into oven and bake until cooked through, about 15-20 minutes.* Open the packet and broil for 2-3 minutes, or until caramelized and slightly charred.\n\nServe immediately, garnished with green onions and sesame seeds, if desired.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/fcce39c0-095c-4514-a090-ab0aa9da1740.png"],"url":"https://damndelicious.net/2014/12/19/asian-salmon-foil/","nutrition":"Nutrition Facts\nServing Size\nServings Per Container 4\nAmount Per Serving\nCalories 434.0\nCalories from Fat 161.1\n% Daily Value*\nTotal Fat 17.9g\n28%\nSaturated Fat 2.7g\n14%\nTrans Fat 0g\nCholesterol 125.6mg\n42%\nSodium 368.7mg\n15%\nTotal Carbohydrate 20.7g\n7%\nDietary Fiber 0.6g\n2%\nSugars 17.7g\nProtein 46.1g\n92%\n*Percent Daily Values are based on a 2,000 calorie diet. Your daily values may be higher or lower depending on your calorie needs.","favorite":false,"rating":0.0,"lastModifiedDate":"2020-10-28 19:10:19","uuid":-1207085469,"originalPicture":"https://s23209.pcdn.co/wp-content/uploads/2014/12/IMG_4738edit.jpg","categories":[{"title":"Entree"}],"tags":[{"title":"Asian"},{"title":"seafood"}],"keywords":"Asian;seafood"},{"title":"Asian Glazed Salmon","description":"This salmon is marinated in a simple but super tasty Asian marinade and then broiled/grilled to produce a gorgeous caramelisation. Fast enough for midweek, fancy enough for company!","preparationTime":"5","cookingTime":"10","totalTime":"15","quantity":"2","ingredients":"2 salmon fillets (, skinless (approximately 0.8 - 1lb / 400 - 500g))\n1 tsp fresh ginger (, finely grated)\n1 garlic clove (, crushed)\n1 tbsp soy sauce\n2 tbsp oyster sauce\n2 tbsp sweet chili sauce ((Note 1))\nSesame seeds\nScallions/shallots (, finely sliced)\nSteamed Asian Greens\nRice","instructions":"Combine the Marinade ingredients in a shallow bowl. Add salmon and turn to coat. Cover and marinate for 30 minutes or up to overnight.\n\nHeat grill/broiler on high. Place the rack 25 cm / 10\" from the heat source.\n\nPlace salmon on baking tray (no oil required). Scrape all the excess glaze from the bowl onto the salmon.\n\nGrill/broil for 7 to 10 minutes, until the top of the salmon is beautifully caramelised. Be careful not to overcook the salmon!\n\nServe salmon sprinkled with sesame seeds, scallions/shallots with rice and steamed Asian greens on the side.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/8560ba0c-0547-4684-be32-6d5e2b0877c4.png"],"url":"https://www.recipetineats.com/asian-glazed-salmon/","nutrition":"servingSize : 214 g\ncalories : 276 kcal","favorite":false,"rating":0.0,"lastModifiedDate":"2020-10-28 19:11:00","uuid":1786419476,"originalPicture":"https://www.recipetineats.com/wp-content/uploads/2015/10/Asian-Glazed-Salmon_680px_1.jpg","categories":[{"title":"Entree"}],"tags":[{"title":"seafood"}],"keywords":"seafood"},{"title":"Dijon Salmon Salad","preparationTime":"5","cookingTime":"10","totalTime":"15","quantity":"4","ingredients":"5 tablespoons olive oil\n2 tablespoons white wine vinegar\n1/2 tablespoon Dijon mustard\n4 6 ounces salmon fillets\n3 cups watercress\n4 radishes, thinly sliced","instructions":"In bowl, whisk 4 tbsp. oil, vinegar and mustard; season. In skillet, heat 1 tbsp. oil over medium-high. Cook salmon, skin side down, 6 minutes. Turn and cook 2 minutes. Divide veggies among plates. Top with salmon and dressing.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/e68fd575-b774-4085-a1b6-96d50c87eb5b.png"],"url":"https://www.rachaelraymag.com/recipe/salmon-dijon-salad","favorite":false,"rating":0.0,"lastModifiedDate":"2020-11-18 07:20:42","uuid":1585911408,"originalPicture":"https://www.rachaelraymag.com/.image/t_share/MTQ1NzE3Mjc4NTIzMDA4MDUy/dijon-salmon-salad-102385034.jpg","categories":[{"title":"Entree"}],"tags":[{"title":"seafood"},{"title":"French"}],"keywords":"seafood;French"},{"title":"Trout with Lemon & Herbs","preparationTime":"10min","cookingTime":"10min","totalTime":"20","quantity":"2","ingredients":"4 tablespoons butter\n2 skin-on trout fillets (6 to 8 oz. each)\nSalt and pepper\n4 sprigs thyme\n2 small lemons, 1 thinly sliced and 1 juiced\n1 tablespoon finely chopped flat-leaf parsley","instructions":"In a large (10- to 12-inch) cast-iron skillet, melt the butter over medium-high heat. Season the trout with 1/2 tsp. each salt and pepper. Place the trout, skin side down, in the skillet. Scatter with the thyme and lemon slices.\nCook the trout, spooning the butter from the bottom of the skillet over the fish often, until just cooked through (do not flip), about 5 minutes. Transfer the fish and lemon slices to a serving plate.\nRemove the skillet from the heat and stir in the lemon juice, scraping up any browned bits from the bottom of the pan. Spoon the pan sauce over the fish. Top with the parsley.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/c7d65ac8-60e4-400a-be04-09f226dd5d34.png"],"url":"https://www.rachaelraymag.com/recipe/trout-with-lemon-and-herbs","favorite":false,"rating":0.0,"lastModifiedDate":"2020-10-28 19:13:17","uuid":-99037634,"originalPicture":"https://www.rachaelraymag.com/.image/t_share/MTQ3ODUyNDkxNzE4MjA3NDEw/trout-with-lemon-and-herbs-102035638.jpg","categories":[{"title":"Entree"}],"tags":[{"title":"seafood"}],"keywords":"seafood"},{"title":"Jerk Fish Dinner","quantity":"4","ingredients":"2 tablespoons EVOO\n4 tilapia or catfish fillets\n2 tablespoons jerk seasoning\n6 cups watercress\n1 ear corn, kernels cut from cob\n2 tablespoons fresh lime juice","instructions":"In skillet, heat 1 tbsp. EVOO over medium-high. On plate, season fish, then sprinkle with jerk seasoning. Cook until flaky, 3 to 4 minutes per side. In bowl, toss all remaining ingredients; season. Serve with fish.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/8dbb42a8-eaad-4b93-9570-c12c91132dc4.png"],"url":"https://www.rachaelraymag.com/recipe/jerk-fish-dinner","favorite":false,"rating":0.0,"lastModifiedDate":"2020-10-28 19:13:53","uuid":737015364,"originalPicture":"https://www.rachaelraymag.com/.image/t_share/MTQ1OTQ3NzUyMzczNjkyMDg3/jerk-fish-dinner-102439695.jpg","categories":[{"title":"Entree"}],"tags":[{"title":"seafood"}],"keywords":"seafood"},{"title":"Fish and chips","description":"Shallow frying the fish and baking rather than frying the chips makes our skinny fish and chips lighter so you can enjoy this delicious British takeaway classic without feeling too guilty. An easy, healthier way to enjoy a taste of British seaside!","totalTime":"40","ingredients":"potatoes 4 medium, cut into thick wedges\nsunflower oil\npaprika ½ tsp\nwhite breadcrumbs 100g\nlemon ½, finely zested\nplain flour 2 tbsp\negg 1 medium, beaten\nsustainably sourced thick white fish fillets 4 x 125g\nlemon wedges to serve","instructions":"Heat the oven to 200C/fan oven 180C/gas 6. Toss the potato with 1 tbsp oil, paprika and some seasoning. Put on a baking tray and cook for 30 minutes, turning once, until golden and tender.\n\nMix the breadcrumbs and lemon zest, season then tip onto a plate. Put the flour on another plate and the egg in a shallow bowl.\n\nDust the fish in the flour, dip in egg, then coat in breadcrumbs. Heat 1 tbsp oil in a large non-stick frying pan and fry the fish for 2 minutes on each side until it is crisp and golden brown. \n\nServe with chips and lemon wedges.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/f7defbc6-b649-46cb-8957-d7e96cf493f1.png"],"url":"https://www.olivemagazine.com/recipes/fish-and-seafood/healthier-fish-and-chips/","nutrition":"calories : 350 calories\nfat : 8 grams fat\nsaturatedFat : 0 gram saturated fat\ncarbohydrate : 40 grams carbohydrates\nsugar : 0 gram sugar\nfiber : 2 grams fibre\nprotein : 30 grams protein\nsodium : 0 milligram of sodium","favorite":false,"rating":3.5,"lastModifiedDate":"2020-12-12 21:54:24","uuid":-448257071,"originalPicture":"https://images.immediate.co.uk/production/volatile/sites/2/2015/03/5064.jpg?quality=45&resize=768,574","categories":[{"title":"Entree"}],"tags":[{"title":"seafood"},{"title":"comfort food"},{"title":"British"}],"keywords":"seafood;comfort food;British"},{"title":"Roasted Niçoise Salad with Halibut","description":"Marinated artichoke hearts get super-crispy and addictively delicious when roasted, making them the secret star of this simple sheet-pan dinner.","preparationTime":"25 minutes","cookingTime":"45","totalTime":"45 minutes","quantity":"4 servings","ingredients":"1 1/2 lb. Yukon Gold potatoes, cut into 1 1/2\" pieces\n2 (12-oz.) jars marinated artichoke hearts, drained\n5 Tbsp. extra-virgin olive oil, divided\n1 1/4 tsp. kosher salt, divided\n1 tsp. freshly ground black pepper, divided\n1 lb. green beans, preferably haricots verts, trimmed\n1/2 cup pitted Kalamata olives, halved\n1 1/2 lb. skinless halibut fillets\n1/2 cup mayonnaise\n1 tsp. finely grated lemon zest, preferably Meyer\n3 Tbsp. fresh lemon juice, preferably Meyer\n1/4 cup basil leaves (from about 1/2 bunch)","instructions":"Place a rimmed baking sheet on center rack of oven; preheat to 450°F.\nToss potatoes, artichokes, 3 Tbsp. oil, 1/2 tsp. salt, and 1/4 tsp. pepper in a large bowl. Arrange in an even layer on preheated sheet and roast, tossing once halfway through, until nicely browned, about 18 minutes.\nToss green beans, olives, 1 Tbsp. oil, and 1/4 tsp. salt in same bowl. Season fish on both sides with 1/2 tsp. salt and 1/4 tsp. pepper, then coat with remaining 1 Tbsp. oil.\nRemove baking sheet from oven and push potatoes and artichokes to one side, taking up about a third of pan. Place fish on another third, then bean mixture on remaining third. Roast until fish is cooked through, about 8 minutes.\nMeanwhile, whisk mayonnaise, lemon zest, lemon juice, and remaining 1/4 tsp. salt and 1/2 tsp. pepper in a small bowl.\nFlake halibut into pieces and transfer to a platter. Serve with roasted vegetables and sauce alongside. Top with basil.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/1d8a0bad-1e05-4d27-9b7f-eeae542c55c6.png"],"url":"https://www.epicurious.com/recipes/food/views/roasted-nicoise-salad-with-halibut-green-beans-potatoes-artichoke-hearts","favorite":false,"rating":0.0,"lastModifiedDate":"2020-10-28 19:15:40","uuid":-1050756909,"originalPicture":"https://assets.epicurious.com/photos/5a7240a311fc4e10ac43a9f5/2:1/w_1260%2Ch_630/Roasted-Nicoise-Salad-with-Halibut-31012018.jpg","categories":[{"title":"Entree"}],"tags":[{"title":"veggies"},{"title":"starch"},{"title":"seafood"},{"title":"French"}],"keywords":"veggies;starch;seafood;French"},{"title":"Philly Cheesesteaks","description":"Lena Abraham is the Food Editor at Delish, where she develops and styles recipes for video and photo, and also stays on top of current food trends.","preparationTime":"0 hours 20 mins","totalTime":"0 hours 45 mins","quantity":"4","ingredients":"2 tbsp. extra-virgin olive oil, divided\n2 green peppers, thinly sliced\n2 red peppers, thinly sliced\n1 large yellow onion, sliced\nKosher salt\n1 1/2 lb. sirloin steak, thinly sliced\nFreshly ground black pepper\n8 slices provolone\n4 hoagie rolls","instructions":"In a large skillet over medium heat, heat 1 tablespoon oil. Add peppers and onion and season with salt. Cook, stirring often, until caramelized, 12 to 15 minutes.\n\nRemove onions and peppers from skillet and set aside. Add remaining tablespoon oil and cook steak until it has almost reached your preferred doneness, about 5 minutes. Season with salt and pepper.\n\nReturn veggies to skillet and toss to combine with steak. Blanket mixture with provolone and cook, covered, until the cheese is melted, about 3 minutes more. Divide mixture among hoagie rolls and serve.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/a984a291-f986-49af-b76b-b98937ae431e.png"],"url":"https://www.delish.com/cooking/recipe-ideas/recipes/a54006/easy-homemade-philly-cheesesteak-recipe/","favorite":false,"rating":0.0,"lastModifiedDate":"2020-10-28 19:16:51","uuid":471156595,"originalPicture":"https://hips.hearstapps.com/del.h-cdn.co/assets/17/26/2048x1024/landscape-1498851838-shot-2-195.jpg?resize=1200:*","categories":[{"title":"Entree"},{"title":"Sandwich"}],"tags":[{"title":"beef"},{"title":"milk protein"},{"title":"American"}],"keywords":"beef;milk protein;American"},{"title":"Blackened Salmon Fillets","description":"Fire up succulent salmon with an exciting blend of Cajun-style spices!","preparationTime":"15","cookingTime":"10","totalTime":"25","quantity":"4 servings","ingredients":"2 tablespoons ground paprika\n1 tablespoon ground cayenne pepper\n1 tablespoon onion powder\n2 teaspoons salt\n½ teaspoon ground white pepper\n½ teaspoon ground black pepper\n¼ teaspoon dried thyme\n¼ teaspoon dried basil\n¼ teaspoon dried oregano\n4 salmon fillets, skin and bones removed\n½ cup unsalted butter, melted","instructions":"In a small bowl, mix paprika, cayenne pepper, onion powder, salt, white pepper, black pepper, thyme, basil and oregano.\n\nBrush salmon fillets on both sides with 1/4 cup butter, and sprinkle evenly with the cayenne pepper mixture. Drizzle one side of each fillet with 1/2 remaining butter.\n\nIn a large, heavy skillet over high heat, cook salmon, butter side down, until blackened, 2 to 5 minutes. Turn fillets, drizzle with remaining butter, and continue cooking until blackened and fish is easily flaked with a fork.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/90433b85-bb56-42fc-99e9-ed376cc289a4.png"],"url":"https://www.allrecipes.com/recipe/36487/blackened-salmon-fillets/","nutrition":"calories : 511.1 calories\ncarbohydrate : 4.5 g\ncholesterol : 166.4 mg\nfat : 38.3 g\nfiber : 2 g\nprotein : 37.4 g\nsaturatedFat : 17.2 g\nsodium : 1248.4 mg\nsugar : 1.1 g","favorite":false,"rating":0.0,"lastModifiedDate":"2020-10-28 19:17:48","uuid":274580813,"originalPicture":"https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1095418.jpg","categories":[{"title":"Entree"}],"tags":[{"title":"seafood"},{"title":"American"}],"keywords":"seafood;American"},{"title":"Caesar Chicken Sandwiches","description":"Greet grilled chicken breasts with flavor!  Marinating in salad dressing is the secret.","preparationTime":"20","totalTime":"140","quantity":"2","ingredients":"2 boneless skinless chicken breast halves\n1/4 cup purchased Caesar salad dressing\n1 tablespoon chopped fresh chives\n2 kaiser buns, split\n2 (1-oz.) slices provolone cheese\n1 tablespoon purchased Caesar salad dressing\n2 leaves romaine lettuce\n2 slices tomato","instructions":"1\nPlace 1 chicken breast half, boned side up, between 2 pieces of plastic wrap or waxed paper. Working from center, gently pound chicken with flat side of meat mallet or rolling pin until about 1/4 inch thick; remove wrap. Repeat with remaining chicken breast half.\n\n2\nPlace chicken breast halves in large nonmetal dish or resealable food storage plastic bag. Add 1/4 cup salad dressing and chives; stir or turn bag to coat. Cover dish or seal bag. Refrigerate at least 2 hours to marinate, turning occasionally.\n\n3\nHeat grill. When ready to grill, remove chicken from marinade; reserve marinade. Place chicken on gas grill over medium heat or on charcoal grill 4 to 6 inches from medium coals; cover grill. Cook 8 to 10 minutes or until chicken is fork-tender and juices run clear, turning once and brushing occasionally with reserved marinade. Discard any remaining marinade.\n\n4\nTo toast buns, place cut sides down on grill during last 1 to 2 minutes of cooking time. Place cheese slice on each chicken breast half; cook just long enough to melt.\n\n5\nSpread bottom halves of buns with 1 tablespoon salad dressing. Top each with lettuce, tomato and cheese-topped chicken breast half. Cover with top halves of buns.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/085f8371-e374-471c-afff-48b96df5cef7.png"],"url":"https://www.pillsbury.com/recipes/caesar-chicken-sandwiches/bc6f0857-0056-4c29-9d1d-c9bc0d22ee2c","nutrition":"Nutrition Information\nNutrition Facts\nServing Size: 1 Sandwich\nCalories560\nCalories from Fat260\n% Daily Value\nTotal Fat29g45%\nSaturated Fat9g45%\nCholesterol100mg33%\nSodium1090mg45%\nTotal Carbohydrate34g11%\nDietary Fiber2g8%\nSugars3g \nProtein40g \n% Daily Value*:\nVitamin A15%15%\nVitamin C6%6%\nCalcium30%30%\nIron15%15%\nExchanges:\n2 1/2 Starch; 4 1/2 Lean Meat; 2 1/2 Fat;\n*Percent Daily Values are based on a 2,000 calorie diet.","favorite":false,"rating":0.0,"lastModifiedDate":"2020-10-28 19:22:52","uuid":665628353,"originalPicture":"https://images-gmi-pmc.edge-generalmills.com/3556476f-9ec8-4a92-82a9-8582602e0d99.jpg","categories":[{"title":"Entree"}],"tags":[{"title":"Italian"}],"keywords":"Italian"},{"title":"Pancakes - American","description":"Introducing my easy fluffy American pancakes recipe. With only 6 ingredients and 2 minutes preparation, you get a perfect fluffy texture. These pancakes make hands down the best easy breakfast or brunch recipe.","preparationTime":"5","cookingTime":"15","totalTime":"20","quantity":"10","ingredients":"1 cup all-purpose flour\n4 tbsp buckwheat flour\n2 Tablespoons sugar\n2 teaspoons baking powder\n1 pinch of salt\n1 cup (240 ml) milk\n2 Tablespoons melted butter or vegetable oil\n1 large egg\nAssorting toppings such as maple syrup, fresh berries, etc.","instructions":"Preheat the oven to 200°F (90°C), with a heatproof platter ready to keep cooked pancakes warm in the oven.\n\nIn a small bowl, whisk together flour, sugar, baking powder, and salt. Set aside.\n\nIn a medium bowl, whisk together milk, butter (or vegetable oil), and egg.\n\nPour the dry ingredients to the milk mixture, and stir (do not overmix).\n\nHeat a large skillet or griddle over medium heat, and coat generously with vegetable oil.\n\nFor each pancake, spoon 2 or 3 tablespoons of batter onto skillet. Cook until the surface of pancakes have some bubbles, about 1 minute. Flip carefully with a thin spatula, and cook until brown on the underside, 1 to 2 minutes more.\n\nTransfer to the heatproof platter, cover with foil and keep warm in the oven until serving. Serve warm, with desired topping such as maple syrup, fresh berries or banana slices.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/9f3d4c65-3ab6-4bfc-b7d2-895b4c6035e5.png"],"url":"https://www.delscookingtwist.com/easy-fluffy-american-pancakes/","favorite":false,"rating":4.5,"lastModifiedDate":"2020-10-31 08:35:18","uuid":-442624005,"originalPicture":"https://1k9ch93e3xh2t4pa12vvmx1t-wpengine.netdna-ssl.com/wp-content/uploads/2019/03/Easy-Fluffy-American-Pancakes_0481bis-320x320-225x225.jpg","categories":[{"title":"Breakfast"}],"tags":[{"title":"starch"},{"title":"American"}],"keywords":"starch;American"},{"title":"Garlic Mashed Potatoes","preparationTime":"5","cookingTime":"40","totalTime":"45","quantity":"Serves 4-6","ingredients":"1 head of garlic\n1 tablespoon extra virgin olive oil\n1 kg potatoes, preferably Yukon Gold or another yellow, waxy potato\nSalt\n1/3 cup cream\n3 Tbsp butter","instructions":"Roast the garlic: Preheat the oven to 400°F. Remove the outer layer of papery skin of the whole garlic head, leaving the head itself intact.\nUsing a paring knife, slice off the tops (1/4-inch to 1/2-inch) of the garlic cloves so they are all exposed. Drizzle olive oil over the garlic heads, salt lightly, and wrap lightly in aluminum foil.\nBake at 400°F for 30 to 40 minutes, or until the cloves feel soft to the touch and are beginning to brown. (See our Roasted Garlic recipe). Remove from the oven and let cool.\n\nBoil the potatoes: While the garlic is roasting, peel and chop the potatoes into 1-inch chunks. Place potatoes in a medium saucepan, add 1/2 teaspoon salt, cover with cold water.\nBring the pot to a boil, reduce to a simmer, and simmer your potatoes until tender when pierced with a fork, about 15 minutes.\n\nWarm the cream and melt the butter together, either in a small pan on the stovetop or in a bowl in the microwave.\n\nMash potatoes with garlic, cream, butter: Drain the pot with the potatoes and put it back on the stovetop over low heat. Put the drained potatoes back in the pot.\nSqueeze the roasted garlic into the potatoes and begin mashing with a potato masher or a large fork.\nAdd the cream and butter and mash until the potatoes are the consistency you want. Do not over-beat them, or they potatoes will become gummy.\nTaste for salt and add some if needed.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/cf52baf0-adb7-4a84-8c27-d4a96db5cc12.png"],"url":"https://www.simplyrecipes.com/recipes/garlic_mashed_potatoes/","favorite":false,"rating":4.5,"lastModifiedDate":"2020-11-29 14:50:28","uuid":1186797077,"originalPicture":"https://www.simplyrecipes.com/wp-content/uploads/2010/11/garlic-mashed-potatoes-horiz-b-1800.jpg","categories":[{"title":"Side"}],"tags":[{"title":"starch"},{"title":"comfort food"}],"keywords":"starch;comfort food"},{"title":"Mac and Cheese","description":"The best stovetop mac and cheese! This recipe is like blue box mac and cheese, but made with real cheddar cheese. It's creamy, delicious and so easy to make! Recipe yields 3 modest or 2 generous servings; multiply and use a larger pot as necessary.","preparationTime":"10","cookingTime":"10","totalTime":"20","quantity":"3","ingredients":"8 ounces (2 cups) regular or whole-wheat macaroni noodles\n2 teaspoons salt, for the pasta cooking water\n1/3 cup heavy cream\n1 1/3 packed cups (5 ounces) grated sharp cheddar cheese\n1/2 teaspoon mustard powder\n1/8 teaspoon garlic powder\n1/8 teaspoon onion powder\nTiny pinch of cayenne pepper, or a dash of your favorite hot sauce","instructions":"Bring a medium pot of water to boil. Add the noodles and salt. Cook until the pasta is al dente, according to package directions. In the meantime, make sure all of your ingredients are measured and ready (I combine the dry spices in a small bowl).\n\nDrain the pasta and leave it in the colander for now. Return the empty pot to medium heat. Immediately add the cream and let the mixture come to a boil. Once boiling, set a timer for 1 minute.\n\nOnce the minute is up, add all of the cheese and spices. Stir until the cheese has fully melted to produce a creamy sauce. Add the pasta, stir until the pasta is evenly coated in cheese sauce, and remove the pot from the heat.\n\nTaste and season with salt, if necessary. Serve immediately.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/cc5c0672-d28c-4df1-85af-f2a29cf37ea4.png"],"url":"https://cookieandkate.com/stovetop-mac-and-cheese-recipe/","nutrition":"calories : 566\nsugar : 3.1 g\nsodium : 507.6 mg\nfat : 26.6 g\nsaturatedFat : 15.2 g\ntransFat : 0.8 g\ncarbohydrate : 59.2 g\nfiber : 2.5 g\nprotein : 21.6 g\ncholesterol : 76.7 mg","favorite":false,"rating":0.0,"lastModifiedDate":"2020-11-04 17:06:59","uuid":-703745892,"originalPicture":"https://cookieandkate.com/images/2018/04/best-stovetop-mac-and-cheese-225x225.jpg","categories":[{"title":"Entree"},{"title":"Side"}],"tags":[{"title":"vegetarian"},{"title":"milk protein"}],"keywords":"vegetarian;milk protein"},{"title":"Panera Macaroni and Cheese","description":"Creamy white cheddar macaroni and cheese just like Panera. Give this copycat version a try. Oh and it’s quick and easy on the stove top too!!","preparationTime":"5","cookingTime":"20","totalTime":"25","quantity":"8","ingredients":"1/4 cup unsalted butter\n1/4 cup all-purpose flour\n1 cup milk (I used skim)\n2 cup heavy cream\n2 cup shredded white cheddar (I used Cabot seriously sharp cheddar)\n1 tsp kosher salt\n1 tsp black pepper\n1 tsp dry mustard\n1lb, pasta, cooked (cavatapppi, shells, or elbow)","instructions":"Cook pasta according to package directions while making the sauce. Drain and set aside until ready to use.\n\nIn a large pot on medium high heat, add butter until melted. Whisk in the flour and cook for about one minute. Reduce heat to medium and add milk, heavy cream, salt, dry mustard and pepper. Continue whisking until it begins to bubble. Reduce to low and add white cheddar. Stir until melted.\n\nAdd cooked pasta, stirring until combined. Remove from heat and allow to sit about 5 minutes to thicken. Season with additional salt and pepper if desired. ENJOY.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/e84f7b66-eae2-49bd-ba6b-30bbefab6b74.png"],"url":"https://www.shugarysweets.com/copycat-panera-macaroni-cheese/","nutrition":"calories : 519 calories\ncarbohydrate : 29 grams carbohydrates\ncholesterol : 115 milligrams cholesterol\nfat : 39 grams fat\nfiber : 1 grams fiber\nprotein : 14 grams protein\nsaturatedFat : 24 grams saturated fat\nservingSize : 1\nsodium : 379 grams sodium\nsugar : 2 grams sugar\ntransFat : 1 grams trans fat\nunsaturatedFat : 12 grams unsaturated fat","favorite":false,"rating":0.0,"lastModifiedDate":"2020-11-04 17:08:02","uuid":148095017,"originalPicture":"https://www.shugarysweets.com/wp-content/uploads/2014/03/copycat-panera-mac-and-cheese-2-480x480.jpg","categories":[{"title":"Entree"}],"tags":[{"title":"vegetarian"},{"title":"milk protein"}],"keywords":"vegetarian;milk protein"},{"title":"Delicious Breakfast Potatoes","preparationTime":"5","cookingTime":"20","totalTime":"25","quantity":"4 servings","ingredients":"3 large potatoes in small cubes\n1 red bell pepper, diced\n1 white/yellow onion, diced\n3 gloves garlic, minced\n\n1 tbsp dried rosemary\n1 tsp paprika\n1 tsp salt\n1 tsp pepper","instructions":"Dice potatoes and boil until almost soft, then drain.\n\nStart frying potatoes in a skillet with oil at medium to high temperature.\n\nCut red bell pepper, onion, and garlic. \nOnce potatoes are a bit crusty, add bell peppers to skillet, followed by onions and then garlic.\n\nSeason with rosemary, garlic, paprika, salt, and pepper. Cook until as desired.\nBonus: Mix in some Cholula sauce for a special savory taste.\n\nServe with your favorite breakfast sides, e.g. fried eggs.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/012b89ec-5753-47ec-928e-88d0140dfa22.png"],"url":"https://tasty.co/recipe/one-pan-breakfast-potatoes","nutrition":"calories : 282 calories\ncarbohydrate : 51 grams\nfat : 7 grams\nfiber : 5 grams\nprotein : 5 grams\nsugar : 7 grams","favorite":true,"rating":4.5,"lastModifiedDate":"2020-11-15 09:22:50","uuid":754874021,"originalPicture":"https://img.buzzfeed.com/video-api-prod/assets/f2362cb99bbd467d9804d8e4dd586d76/BFV16569_One-PanBreakfastPotatoes_ThumbB.jpg","categories":[{"title":"Entree"},{"title":"Side"},{"title":"Breakfast"}],"tags":[{"title":"vegetarian"},{"title":"veggies"},{"title":"starch"},{"title":"vegan"}],"keywords":"vegetarian;veggies;starch;vegan"},{"title":"Lemon Butter Chicken","preparationTime":"10","cookingTime":"35","totalTime":"45","quantity":"4-5 servings","ingredients":"[SEASONED CHICKEN]\n4 chicken breasts, halved\n? mustard or spicier\n3 tbsp garlic powder\n2 tbsp paprika\n1 tbsp onion powder\nsalt & pepper\n\n[SAUCE BASE]\n1 medium yellow onion, sliced\n4 garlic cloves\n0.5 cup chicken broth\n0.5 cup dry white wine\n4 tbsp lemon juice\n1 tsp dried thyme\n\n[CREAM BASE]\n0.5 cup heavy cream\n0.25 cup freshly grated Parmesan cheese\n\n2 cups baby spinach","instructions":"Preheat oven to 200°C.\n\n[SEAR CHICKEN]\n• Prep SEASONED CHICKEN.\n• Melt 2 tbsp butter in a large oven-proof pot over medium high heat.\n• Add the chicken and sear both sides until golden brown. Remove and set aside.\n\n[SAUCE]]\n• Melt 1 tbsp butter in the pan. Saute onion and then garlic. Then add rest of the SAUCE BASE.\n• Bring to a boil and reduce heat. Add the CREAM BASE and cook for 1-2 min.\n • Add in the spinach and simmer until sauce is to the desired thickness (will not really thicken in oven).\n\n[BAKING]\n• Return chicken to the pan.\n• Place in the oven and cook for about 15-20 min.  (internal temp. ~ 73.8°)\n• Remove the dish and let sit for about 5 min. before serving.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/81811d0e-fa7d-4102-a463-907751f21082.png"],"url":"https://www.eazypeazymealz.com/lemon-butter-chicken/","favorite":false,"rating":4.0,"lastModifiedDate":"2020-11-21 15:21:28","uuid":-1742372095,"originalPicture":"https://www.eazypeazymealz.com/wp-content/uploads/2016/07/Lemon-Chicken-Post-Cooked.jpg","categories":[{"title":"Entree"}],"tags":[{"title":"poultry"},{"title":"dutch oven"}],"keywords":"poultry;dutch oven"},{"title":"Grog","description":"a pirate drink for everyone","preparationTime":"2 mins","cookingTime":"2 mins","totalTime":"4","quantity":"1","ingredients":"1 oz. lime juice\n1 oz. brown sugar\n1 oz. dark rum\n4 oz. water\nGlass type: Old-fashioned\n\n? Try with Earl Grey tea instead of just water","instructions":"Add the brown sugar to your shaker, add in a splash of warm water (1 oz.) to dissolve the sugar and add lime juice.\n\nPut in rum, rest of the water and ice.\n\nShake.\n\nPour over smashed ice.\n\nServe.\n\nNow it do be time to talk like a pirate.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/b79f517f-eb08-463c-aa53-40eaf9826169.png"],"url":"https://thedrinkblog.com/grog/","favorite":false,"rating":4.0,"lastModifiedDate":"2020-12-19 19:23:28","uuid":-640814597,"originalPicture":"https://www.thedrinkblog.com/wp-content/uploads/2014/09/tdb-grog-960x640-7-1.jpg","categories":[{"title":"Drink"}],"tags":[{"title":"Alex"}],"keywords":"Alex"},{"title":"Strawberry Tart","description":"Makinze is the Associate Food Editor for Delish.com.","preparationTime":"0 hours 15 mins","totalTime":"3 hours 20 mins","quantity":"10 servings","ingredients":"1 1/3 c. all-purpose flour\n1/4 c. granulated sugar\n1/2 tsp. kosher salt\n10 tbsp. melted butter\n1/2 c. heavy cream\n2 (8 oz.) blocks cream cheese, softened\n1/2 c. granulated sugar\nJuice and zest of 1 lemon\n1 tsp. pure vanilla extract\n1 1/2 lb. strawberries, hulled and sliced\n3 tbsp. strawberry or raspberry preserves","instructions":"Make crust: Preheat oven to 350°. In a large bowl, whisk together flour, sugar, and salt. Add melted butter and stir until dough forms. Press mixture into a 10\" or 11\" tart pan with a removable bottom, pressing until dough is smooth. Prick all over with a fork and bake until golden, 25 to 30 minutes. Let cool completely.\n\nMeanwhile, make filling: In a large bowl using a hand mixer, beat heavy cream until stiff peaks form, 7 minutes. In another large bowl, beat together cream cheese and sugar until smooth. Add lemon juice and zest, and vanilla. Beat until combined. Fold in whipped cream, then spoon into cooled crust and smooth top.\n\nStarting on the outside, arrange strawberries on top of tart in a circle until entire tart is covered.\n\nIn a small microwave-safe bowl, heat together preserves and 2 teaspoons water until warmed, 30 seconds. Brush over tart and refrigerate until well chilled, 2 hours. ","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/3286858f-46d1-436b-8561-2ae399eb1fdb.png"],"url":"https://www.delish.com/cooking/recipe-ideas/a26871609/strawberry-tart-recipe/","favorite":false,"rating":0.0,"lastModifiedDate":"2020-11-21 16:38:43","uuid":-1663210618,"originalPicture":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/190326-strawberry-tart-horizontal-2-1554319677.png?crop=1.00xw:0.752xh;0,0.163xh&resize=1200:*","categories":[{"title":"Dessert"}]},{"title":"French strawberry tart","preparationTime":"20","cookingTime":"40","totalTime":"60","quantity":"1 tart or 6-8 tartlets","ingredients":"1 x sweet tart crust\n\n500 g small strawberries, hulled and halved\n4 tbsp redcurrant jelly\n\n[CREME PÂTISSIÈRE]\n350 ml whole milk\n1 vanilla pod, split lengthways\n4 large free-range egg yolks\n50 g golden caster sugar\n25g plain flour, plus extra for dusting\nFinely grated zest of 1 lemon","instructions":"[CRUST]\nRoll the pastry out on a lightly floured surface to the thickness of a pound coin. Use to line a deep, 23cm fluted, loose-bottomed tart tin. Bake and cool.\n\n[CREME PÂTISSIÈRE]\nIn a large bowl, whisk the yolks and sugar for 10 minutes until voluminous, then beat in the flour and lemon zest.\n\nMeanwhile, put the milk and vanilla pod seeds in a large pan, bring to the boil, then turn off the heat. \nStrain the warm milk slowly into the egg mixture, whisking continuously. Clean the pan, then pour the mixture back in and gently bring to the boil, stirring constantly until it has thickened. Take the pan off the heat, cover the surface of the crème pâtissière with baking paper and leave to cool.\n\n[ASSEMBLY]\nSpoon the crème pâtissière into the tart, then level the surface with the back of a spoon. Place a strawberry half in the centre of the tart, then arrange concentric rings of fruit around it until all of the crème pâtissière is covered.\n\nGently warm the jelly with 2 tbsp water until melted, brush over the strawberries and leave for 2 minutes to set. Serve.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/4ca2e5ab-0a75-4700-9767-100919c1880c.png"],"url":"https://www.deliciousmagazine.co.uk/recipes/french-strawberry-tart/","nutrition":"calories : 368kcals\nfat : 17.7g (5.9g saturated)\nprotein : 6.4g\ncarbohydrate : 48.6g (23.1g sugars)\nfiber : 2.3g","favorite":true,"rating":4.5,"lastModifiedDate":"2020-12-12 22:12:44","uuid":1157910257,"originalPicture":"https://www.deliciousmagazine.co.uk/wp-content/uploads/2018/09/470854-1-eng-GB_simple-french-strawberry-tart.jpg","categories":[{"title":"Dessert"}],"tags":[{"title":"French"},{"title":"Ariel"},{"title":"tart"}],"keywords":"French;Ariel;tart"},{"title":"Sweet Tart Crust","preparationTime":"10 minutes","cookingTime":"15-25 minutes","inactiveTime":"60 minutes","totalTime":"85","quantity":"1 tart or 6-7 tartlets","ingredients":"[DRY]\n1.25 cups flour\n0.25 cup sugar\npinch of salt\n\n115 g butter, melted\n1 large egg\n1 tsp vanilla extract","instructions":"Mix DRY ingredients. \n\nAdd butter and pulse until mixture becomes crumbly and resembles coarse meal. Add egg and vanilla extract – the dough should stick without feeling dry or crumbly.\n\nTurn dough to a lightly floured surface and form into a ball. It should come together easily without being sticky. Flatten ball slightly with your hands to form a thick disc. Wrap with plastic wrap and REFRIGERATE for at least 1 hour.\n\nTake dough out of the fridge and let it sit on the counter for a few minutes to soften slightly for easy rolling. On a lightly floured surface, roll the dough out into an 11-inch circle, then place gently into a 9-inch tart pan (preferably with a removable bottom); you can do this by flouring a rolling pan and rolling the dough loosely around it, then unrolling it into the pan. Brush away any excess flour on the surface. With a sharp knife, trim the edges of the pastry to fit the tart pan.\n\nPreheat oven to 190°C and place rack in the center.\n\nPress parchment paper or aluminum foil tightly against the crust, covering the edges to prevent them from burning. Fill with pie weights/dried beans/uncooked rice, making sure they’re fully distributed over the entire surface.\n\nBake crust for 20 minutes, until foil no longer sticks to the dough. Transfer crust to a wire rack and remove weights and foil. Transfer to a wire rack and let cool completely.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/27616ba7-f627-407d-a663-95aa7be4ee8d.png"],"url":"https://prettysimplesweet.com/sweet-tart-crust/","favorite":false,"rating":4.0,"lastModifiedDate":"2020-12-12 22:07:14","uuid":780965529,"originalPicture":"https://prettysimplesweet.com/wp-content/uploads/2015/12/TartCrust_230.jpg","categories":[{"title":"Dessert"}],"tags":[{"title":"French"},{"title":"tart"}],"keywords":"French;tart"},{"title":"White Chocolate Raspberry Swirl Cheesecake","description":"This beautiful dessert features a creamy white chocolate cheesecake base with a tart ribbon of red raspberries swirled throughout.","preparationTime":"20","cookingTime":"60","totalTime":"80","quantity":"10","ingredients":"1 (12 oz.) package frozen raspberries\n1/2 cup water\n2 tablespoons sugar\n1 tablespoon cornstarch\n1 1/4 cups graham cracker crumbs\n1/4 cup butter, melted\n2 cups white chocolate chips\n1/2 cup Half and Half\n3 (8 oz.) packages cream cheese, softened\n1/2 cup sugar\n1 tablespoon flour\n3 eggs, room temperature\n1 teaspoon vanilla","instructions":"In a medium bowl, mix together graham cracker crumbs and melted butter. Press mixture into the bottom of a lightly greased 9 inch springform pan.\n\nIn a medium saucepan, make the raspberry sauce by combining raspberries, 2 tablespoons sugar, cornstarch, and water. Bring to boil, and continue boiling 5 minutes, or until sauce is thick. Strain sauce through a mesh strainer to remove seeds.\n\nPlace a baking pan filled with hot water on the lower rack of the oven. Preheat oven to 325 degrees. In a metal bowl over a pan of simmering water, melt white chocolate chips with half-and-half, stirring occasionally until smooth. Alternately, white chocolate can be melted in the microwave with the Half and Half in a glass bowl, at 50% power, stirring every 30-60 seconds until smooth.\n\nIn a large bowl, beat cream cheese and 1/2 cup sugar with an electric mixer until smooth. Blend in flour. With mixer on low speed, blend in eggs one at a time. Blend in vanilla and melted white chocolate.\n\nPour half of batter over crust. Spoon 3 tablespoons raspberry sauce over batter. Pour remaining cheesecake batter into pan, and again spoon 3 tablespoons raspberry sauce over the top. Swirl batter with the tip of a knife to create a marbled effect.\n\nBake for 55 to 60 minutes, or until filling is set. Cool, cover with plastic wrap, and refrigerate for 8 hours before removing from pan. Serve with remaining raspberry sauce.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/d26276d2-4b54-4a6c-8ef0-1910b294cf1d.png"],"url":"https://letsdishrecipes.com/white-chocolate-raspberry-swirl-cheesecake/","nutrition":"calories : 461 calories\ncarbohydrate : 47 grams carbohydrates\ncholesterol : 105 milligrams cholesterol\nfat : 28 grams fat\nfiber : 2 grams fiber\nprotein : 7 grams protein\nsaturatedFat : 16 grams saturated fat\nservingSize : 1\nsodium : 225 grams sodium\nsugar : 38 grams sugar\ntransFat : 0 grams trans fat\nunsaturatedFat : 10 grams unsaturated fat","favorite":false,"rating":0.0,"lastModifiedDate":"2020-11-29 21:03:13","uuid":2048476764,"originalPicture":"https://letsdishrecipes.com/wp-content/uploads/2018/06/White-chocolate-feature-480x480.jpg","categories":[{"title":"Dessert"}]},{"title":"Holiday Cheesecake - pumpkin & raspberry + chocolate swirl","preparationTime":"45","cookingTime":"60","totalTime":"585","quantity":"12-16 slices","ingredients":"[SHORTBREAD CRUST]\n3 cups all-purpose flour\n250 g butter, melted\n0.6 cups (light brown) sugar\n2 eggs, beaten\n\n[CREAM]\n~875-900 g Philadelphia cream cheese, softened to room temperature\n0.75 cups granulated sugar\n0.3 cup sour cream, at room temperature\n1 tsp pure vanilla extract\n3 large eggs\n\n[PUMPKIN CREAM] - for half a cheesecake\n113 g pumpkin puree\n2 tsp ginger powder (or cinnamon)\n0.25 tsp nutmeg\n\n[RASPBERRY SAUCE] - for half a cheesecake\n340 g frozen raspberries\n0.3 cup water\n2 tbsp sugar\n1 tbsp cornstarch\n\n[CHOCOLATE]\n80 g chocolate chips\n\n[TOPPINGS]\n• caramel (for pumpkin side)\n• whipped cream OR Greek yogurt","instructions":"Adjust the oven rack to the lower-middle position & preheat oven to 175°C.\n\n[SHORTBREAD CRUST]\nMix together crust ingredients. Press firmly into the bottom and two-thirds up the sides of a 25 cm springform pan. Pre-bake for 10 minutes or until lightly golden brown.\n\n[CREAM]\nBeat the CREAM mixture (without eggs) on medium speed in a large bowl until creamy. Add the eggs one at a time, beating after each addition until just blended. (To prevent the cheesecake from deflating and cracking as it cools, avoid over-mixing the batter as best you can.)\n\n[PUMPKIN CREAM] - for half a cheesecake\nScoop out 1 cup of CREAM & put into a medium mixing bowl. Stir in the PUMPKIN ingredients.\n\n[RASPBERRY SAUCE] - for half a cheesecake\nIn a medium saucepan, add all ingredients for RASPBERRY SAUCE. Bring to boil, and continue boiling 5 minutes, or until sauce is slightly thickened. Strain sauce through a mesh strainer to remove seeds. Use spatula to improve liquid separation by repeatedly brushing over bottom of the strainer.\n\n[CHOCOLATE]\nMelt chocolate chips, be careful not to burn them.\n\n[ASSEMBLE CAKE]\nThe cake is composed of layers of CREAM and flavors. Into the crust:\n• spread 1 cm layer of CREAM\n• on half the cake, drop 1 tbsp PUMPKIN CREAM. Do this 3 more times in different areas. Using a knife   \n  or sharp edge swirl the two layers some.\n• on the other half of the cake, alternate between dropping 1 tsp RASPBERRY SAUCE and CHOCOLATE. \n   In total, you'll have around 10-12 drops. Again swirl together layers.\n• Repeat steps until out of CREAM.\n\n[BAKING]\nIn another baking dish or roasting pan, put 2 cm of water. Put this dish a level below where the cake where sit.\n\nPut cake on lower-middle rack.\n\n(Note: if you notice the cheesecake browning too quickly on top, tent it with aluminum foil halfway through baking.) Bake cheesecake for 55-70 minutes or until the center is almost set. When it’s done, the center of the cheesecake will slightly wobble if you gently shake the pan. Turn the oven off and open the oven door slightly. Let the cheesecake sit in the oven for 1 hour as it cools down. Remove cheesecake from the oven and allow to cool completely at room temperature, then refrigerate the cheesecake for at least 4 hours or overnight.\n\nUse a knife to loosen the chilled cheesecake from the rim of the springform pan, then remove the rim.\nFor neat slices, wipe the knife clean and dip into warm water between each slice.\n\nCover and store leftover cheesecake in the refrigerator for up to 5 days.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/cf4533a2-3472-4aaa-a0b0-851fa874462b.png","/storage/emulated/0/Android/data/fr.recettetek/files/images/ca900f33-0c8e-4252-ac94-9fd9fbb6f2f8.png","/storage/emulated/0/Android/data/fr.recettetek/files/images/aca369e6-c1fd-42cb-9360-9c1ddde32aeb.png"],"url":"https://www.food.com/recipe/new-york-style-cheesecake-on-shortbread-crust-14561\nhttps://sallysbakingaddiction.com/pumpkin-cheesecake/\nhttps://letsdishrecipes.com/white-chocolate-raspberry-swirl-cheesecake/","favorite":true,"rating":4.5,"lastModifiedDate":"2020-11-29 21:19:03","uuid":-433156169,"originalPicture":"https://cdn.sallysbakingaddiction.com/wp-content/uploads/2018/10/pumpkin-cheesecake-3-225x225.jpg","categories":[{"title":"Dessert"}],"tags":[{"title":"vegetarian"},{"title":"holiday"},{"title":"Alex"}],"keywords":"vegetarian;holiday;Alex"},{"title":"Salted Caramel","preparationTime":"10","cookingTime":"10","totalTime":"10","quantity":"1","ingredients":"1 cup granulated sugar\n6 tbsp salted butter\n0.5 cup heavy cream\n1 tsp salt","instructions":"MEASURE all ingredients first! No time during to do.\n\nHeat granulated sugar in a medium heavy-duty saucepan over medium heat, stirring constantly with a high heat resistant rubber spatula or wooden spoon. Sugar will form clumps and eventually melt into a thick brown, amber-colored liquid as you continue to stir. Be careful not to burn.\n\nOnce sugar is completely melted, immediately add the butter. Be careful in this step because the caramel will bubble rapidly when the butter is added. If you notice the butter separating or if the sugar clumps up, remove from heat and vigorously whisk to combine it again. (If you’re nervous for splatter, wear kitchen gloves. Keep whisking until it comes back together, even if it takes 3-4 minutes. It will eventually– just keep whisking. Return to heat when it’s combined again.)\n\nAfter the butter has melted and combined with the caramelized sugar, cook for 2 minutes without stirring.\n\nVery slowly stir in the heavy cream. Since the heavy cream is colder than the hot caramel, the mixture will rapidly bubble when added. After all the heavy cream has been added, stop stirring and allow to boil for 1 minute. It will rise in the pan as it boils.\n\nRemove from heat and stir in the salt. Allow to slightly cool down before using. Caramel thickens as it cools.\n\nCover tightly and store for up to 1 month in the refrigerator. Caramel solidifies in the refrigerator. Reheat in the microwave or on the stove to desired consistency.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/6e1fa0c5-8e8a-4f11-a55f-51961161e26a.png"],"url":"https://sallysbakingaddiction.com/homemade-salted-caramel-recipe/#tasty-recipes-68127","favorite":false,"rating":4.0,"lastModifiedDate":"2020-11-29 21:23:12","uuid":-84257004,"originalPicture":"https://cdn.sallysbakingaddiction.com/wp-content/uploads/2013/11/salted-caramel_-225x225.jpg","categories":[{"title":"Dessert"}]},{"title":"Cherry Marzipan Streusel Cake","preparationTime":"15 mins","cookingTime":"45 mins","totalTime":"60","quantity":"6-8","ingredients":"½ cup (1 stick) butter, at room temperature\n1 cup sugar\n⅓ cup Easy Homemade Marzipan or Almond Paste\n1 large egg\n½ cup buttermilk\n1 teaspoon pure vanilla extract\n1½ cup all-purpose unbleached flour\n1 teaspoon baking powder\n½ teaspoon baking soda\n½ teaspoon salt\n2 cups fresh cherries, pitted and halved or canned cherries (drain first) or frozen cherries (thaw and drain first) *Fresh cherries strongly recommended as canned and frozen emit more liquid and can result in a soggy cake unless super thoroughly drained first.\nFor the Streusel Topping:\n½ cup all-purpose unbleached flour\n½ cup sugar\n⅓ cup Easy Homemade Marzipan or Almond Paste (see recipe link above), crumbled\n4 tablespoons butter, cut into small pieces\nPowdered sugar for dusting","instructions":"Preheat the oven to 350 degrees F. Grease a 9 inch springform.\n\nTo make the streusel topping: Combine the flour and sugar in a medium bowl. Add the almond paste and butter and use your fingers to combine the mixture until it resembles sandy clumps. Set aside.\n\nUsing an electric mixer, beat the butter and sugar together for several minutes until light and fluffy. Add the almond paste and vanilla extract and beat until combined. Add the egg and beat until combined.\n\nIn another bowl, combine the flour, baking powder, baking soda and salt. Set aside.\n\nUsing a rubber spatula, stir in half of the buttermilk followed by half of the flour mixture. Fold in the remaining buttermilk followed by the rest of the flour mixture. Be careful not to over-stir.\n\nSpoon the mixture into the greased springform, smoothing the top. Place the cherries on the top, then sprinkle the streusel topping over it.\n\nBake on the middle rack for 45-55 minutes or until a toothpick inserted into the center of the cake comes out clean. Let the cake sit in the springform for 10 minutes before removing, then allow to cool completely on a wire rack. Once cooled, sift powdered sugar over the top. Serve plain, with whipped or ice cream.\n\nThis cake tastes even better the next day.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/8e6e2f40-bdec-4c2f-9b65-544d5649838c.png"],"url":"https://www.daringgourmet.com/cherry-marzipan-streusel-cake/","favorite":false,"rating":0.0,"lastModifiedDate":"2020-12-01 21:14:17","uuid":-47472911,"originalPicture":"https://www.daringgourmet.com/wp-content/uploads/2014/06/Cherry-Marzipan-Streusel-Cake-words-typo-corrected-2.jpg","categories":[{"title":"Dessert"}]},{"title":"Angel Food Cake","description":"Using only 6 ingredients, this perfect angel food cake bakes up tall, light, and airy. For best results, read the recipe in full before beginning and have all your ingredients ready to go. Enjoy! ","preparationTime":"25","cookingTime":"40","totalTime":"240","quantity":"10","ingredients":"1 cups granulated sugar*\n1 cup + 2 Tablespoons (135g) cake flour (spoon & leveled)\n1/4 teaspoon salt\n12 large egg whites, at room temperature*\n1 and 1/2 teaspoons cream of tartar\n1 and 1/2 teaspoons pure vanilla extract\noptional: confectioners’ sugar for dusting, whipped cream, and berries","instructions":"Adjust the oven rack to the lower middle position and preheat oven to 325°F (163°C).\n\nIn a food processor or blender, pulse the sugar until fine and powdery. Remove 1 cup and set aside to use in step 3; keep the rest inside the food processor. Add the cake flour and salt to the food processor. Pulse 5-10 times until sugar/flour/salt mixture is aerated and light.\n\nIn a large bowl using a hand mixer or a stand mixer fitted with a whisk attachment, whip egg whites and cream of tartar together on medium-low until foamy, about 1 minute. Switch to medium-high and slowly add the 1 cup of sugar you set aside. Whip until soft peaks form, about 5-6 minutes. See photo and video above for a visual. Add the vanilla extract, then beat just until incorporated.\n\nIn 3 additions, slowly sift the flour mixture into the egg white mixture using a fine mesh strainer, gently folding with a rubber spatula after each addition. To avoid deflating or a dense cake, don’t add the flour mixture all at once. Sift and very slowly fold in several additions. This is important! Pour and spread batter into an ungreased 9 or 10 inch tube pan. Shimmy the pan on the counter to smooth down the surface.\n\nBake the cake until a toothpick inserted comes out clean, about 40-45 minutes. Rotate the pan halfway through baking. The cake will rise up very tall while baking. Remove from the oven, then cool the cake completely upside-down set on a wire rack, about 3 hours. (Upside-down so the bottom of the tube pan is right-side up, see photo and video above.) Once cooled, run a thin knife around the edges and gently tap the pan on the counter until the cake releases.\n\nIf desired, dust with confectioners’ sugar. Slice the cake with a sharp serrated knife. Regular knives can easily squish the cake. Serve with whipped cream and fresh berries.\n\nStore leftovers in the refrigerator for up to 5 days.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/8a84ad50-c4a3-4a19-9440-38df24f475ee.png"],"url":"https://sallysbakingaddiction.com/angel-food-cake/","favorite":false,"rating":2.5,"lastModifiedDate":"2020-12-12 21:53:41","uuid":1784470764,"originalPicture":"https://cdn.sallysbakingaddiction.com/wp-content/uploads/2019/05/angel-food-cake-225x225.jpg","categories":[{"title":"Dessert"}]},{"title":"Lemon Curd","preparationTime":"5","cookingTime":"10","totalTime":"15","quantity":"1","ingredients":"90 g unsalted butter, cubed\n\n[BASE]\n4 large egg yolks\n0.5 cup sugar\nzest of a lemon\n100 ml lemon juice\npinch of salt\n\n","instructions":"Place BASE into a pot and constantly whisk. Cook until the mixture becomes thick, resembling the texture of hollandaise sauce, ~10 minutes.\n\nRemove pan from heat. Cut the butter into 6 separate pieces, then whisk into the curd.  \n\nPour curd into a jar or container. The curd will continue to thicken as it cools.\n\nRefrigerate the curd for up to about 10 days.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/2183b265-ee83-4390-91f2-37afa579465f.png"],"url":"https://sallysbakingaddiction.com/how-to-make-lemon-curd/","favorite":false,"rating":4.5,"lastModifiedDate":"2020-12-12 22:18:46","uuid":-1350666809,"originalPicture":"https://cdn.sallysbakingaddiction.com/wp-content/uploads/2016/03/lemon-curd-with-lemon-zest-225x225.jpg","categories":[{"title":"Dessert"}],"tags":[{"title":"French"},{"title":"Ariel"},{"title":"tart"}],"keywords":"French;Ariel;tart"},{"title":"Chocolate Ganache","preparationTime":"5","totalTime":"5","quantity":"0.67 cups","ingredients":"115 grams semi-sweet chocolate (chips)\n120 ml heavy whipping cream","instructions":"Chop the chocolate and add it to a large heatproof bowl. Set aside.\n\nPour the heavy whipping cream into a microwave safe bowl and heat in the microwave for 45 seconds to 1 minute. \n\nPour the warm heavy whipping cream over the chocolate and let it sit for 2 to 3 minutes. Start whisking slowly in the middle of the bowl, and continue whisking in one direction until the mixture is smooth and well combined.\n\n(May need to allow it to cool completely before using on a dessert, but sometimes can be used directly)","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/99986e73-0aa5-4772-9726-14ba013ef6d9.png"],"url":"https://www.livewellbakeoften.com/how-to-make-chocolate-ganache/","favorite":false,"rating":4.0,"lastModifiedDate":"2020-12-12 22:22:53","uuid":-2127336756,"originalPicture":"https://www.livewellbakeoften.com/wp-content/uploads/2020/07/How-To-Make-Chocolate-Ganache-7.jpg","categories":[{"title":"Dessert"}],"tags":[{"title":"French"},{"title":"Ariel"},{"title":"tart"}],"keywords":"French;Ariel;tart"},{"title":"Baked Beans","preparationTime":"5","cookingTime":"20","totalTime":"25","quantity":"2-3 sides","ingredients":"1 can white beans, drained & rinsed\n\n[BASE]\n1 shallot, diced\n2 garlic cloves, minced\n\n[SAUCE]\n1 cups (chicken) broth\n0.5 cup water\n1 tsp Worcestershire sauce\n3 tbsp ketchup\n1 tbsp tomato paste\n1 tbsp brown sugar\n1 tbsp apple cider vinegar\n1 tsp garlic powder\n1 tsp onion powder\n0.5 tsp black pepper\n0.5 tsp salt\n\n[THICKENER]\n1.5 tbsp cornstarch\n3 tbsp water","instructions":"Saute BASE in a medium pot. Add all SAUCE ingredients in pot and stir, then add beans.\n\nBring to a boil, simmer for 15 minutes, without the lid. Stir every now and then so the beans don't catch on the bottom of the pot.\n\nPour THICKENER into pot while stirring, then cook for 2 minutes until sauce thickens.\n\nServe it the traditional way - piled over hot buttered toast. \nOr ladle into bowls, eat with a spoon and dunk in hot crusty bread!","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/30795a11-46b2-45d5-906b-dffee253570c.png"],"url":"https://www.recipetineats.com/homemade-baked-beans-recipe-heinz/","favorite":false,"rating":4.5,"lastModifiedDate":"2020-12-13 21:54:07","uuid":-1318366298,"originalPicture":"https://www.recipetineats.com/wp-content/uploads/2014/05/Homemade-Heinz-Baked-Beans_0-SQ.jpg","categories":[{"title":"Entree"},{"title":"Side"},{"title":"Breakfast"}],"tags":[{"title":"plant protein"},{"title":"veggies"},{"title":"vegan"},{"title":"British"}],"keywords":"plant protein;veggies;vegan;British"},{"title":"Peanut Butter and Pumpkin Dog Treats","description":"Baked dog treats filled with pumpkin and peanut butter.","preparationTime":"15","cookingTime":"40","totalTime":"100","quantity":"25 treats","ingredients":"2 ½ cups whole wheat flour\n2 eggs\n½ cup canned pumpkin\n2 tablespoons peanut butter\n½ teaspoon salt\n½ teaspoon ground cinnamon","instructions":"Preheat oven to 350 degrees F (175 degrees C).\n\nWhisk together the flour, eggs, pumpkin, peanut butter, salt, and cinnamon in a bowl. Add water as needed to help make the dough workable, but the dough should be dry and stiff. Roll the dough into a 1/2-inch-thick roll. Cut into 1/2-inch pieces.\n\nBake in preheated oven until hard, about 40 minutes.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/4e985d74-3cd9-43ce-8f45-3db44c6e44d3.png"],"url":"https://www.allrecipes.com/recipe/133123/peanut-butter-and-pumpkin-dog-treats/","nutrition":"calories : 50.1 calories\ncarbohydrate : 9.4 g\ncholesterol : 0 mg\nfat : 0.9 g\nfiber : 1.7 g\nprotein : 2 g\nsaturatedFat : 0.2 g\nsodium : 64.9 mg\nsugar : 0.3 g","favorite":false,"rating":0.0,"lastModifiedDate":"2020-12-14 06:31:27","uuid":-1674877046,"originalPicture":"https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3862651.jpg","categories":[{"title":"Dog"}]},{"title":"Pull-apart Candy Cane Pizza","preparationTime":"20","cookingTime":"20","totalTime":"40","quantity":"2-4 servings","ingredients":"[PIZZA DOUGH]\n1 cup flour, plus more for rolling\n1 envelope Fleischmann's® RapidRise Yeast\n1-1/2 teaspoons sugar\n3/4 teaspoon salt\n2/3 cup very warm water (120° to 130°F)*\n3 tablespoons corn oil\n\n[TOPPINGS]\n1/3 cup pizza sauce\n½ cup shredded mozzarella\n20 slices (turkey) pepperoni\nParmesan cheese, for sprinkling\nBasil leaves, for garnish","instructions":"Preheat the oven to 425°F, line the baking pan with parchment paper.\n\nIn a large bowl, whisk together the flour, Fleischmann's® yeast, sugar and salt.\nAdd the warm water and corn oil and mix together until well combined.\n\nOn a lightly floured surface, knead the dough for about 3 minutes. The dough should form a ball and will be slightly sticky.\n\nPlace the dough back in the bowl and cover with plastic wrap. Let it rest for 10 minutes.\n\nOn a floured surface, roll out the dough to a 6”x 20” rectangle about ¼” thick.\n\nUsing the knife, cut out 3” tall triangles about ½” apart on the bottom of the rectangle.\n\nSpread the pizza sauce on the top of the dough.\nSprinkle the mozzarella cheese evenly.\nPlace the pepperoni slices on top, slightly overlapping each one.\n\nFold the cut ends over the toppings. Press the ends together and tuck the excess dough underneath.\nCarefully curve the top end of the dough to the left to make a candy cane shape.\n\nTransfer to a baking sheet and bake until golden brown, 15-20 minutes.\nSprinkle with parmesan cheese and garnish with basil leaves. Serve warm.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/6aa830b4-98b2-412b-abf1-04803cdb4809.png"],"url":"https://rosannapansino.com/blogs/recipes/pull-apart-candy-cane-pizza","favorite":false,"rating":0.0,"lastModifiedDate":"2020-12-14 06:35:35","uuid":710327905,"originalPicture":"http://cdn.shopify.com/s/files/1/0163/5948/9636/articles/C63A4479_v4_F1SL_grande.jpg?v=1607193378","categories":[{"title":"Entree"},{"title":"Side"}],"tags":[{"title":"Italian"},{"title":"milk protein"},{"title":"pork"}],"keywords":"Italian;milk protein;pork"},{"title":"Pull-apart Tree Pizza","preparationTime":"15","cookingTime":"20","inactiveTime":"10","totalTime":"45","quantity":"2-4 servings","ingredients":"[PIZZA DOUGH]\n1 cup flour, plus more for rolling\n1 envelope Fleischmann's® RapidRise Yeast\n1-1/2 teaspoons sugar\n3/4 teaspoon salt\n2/3 cup very warm water (120° to 130°F)*\n3 tablespoons corn oil\n5 String cheese sticks\n1 egg\n1 tablespoon water\n\n[TOPPINGS]\n¼ cup melted butter\n1 teaspoon garlic powder\n½ tablespoon dried rosemary\n1 tablespoon basil (sliced finely)\n1 tablespoon parsley (chopped finely)\n¼ cup finely shredded parmesan cheese\nRed pepper flakes\nMarinara sauce, for dipping","instructions":"Preheat the oven to 425°F, line the baking pan with parchment paper.\n\nIn a large bowl, whisk together the flour, Fleischmann's® yeast, sugar and salt.\nAdd the warm water and corn oil and mix together until well combined.\nOn a lightly floured surface, knead the dough for about 3 minutes. The dough should form a ball and will be slightly sticky.\n\nPlace the dough back in the bowl and cover with plastic wrap. Let it rest for 10 minutes.\n\nCut the mozzarella sticks into 1” pieces and set it aside.\nOn a floured surface, form the dough into a soft ball and divide into two.\n\nRoll the dough into a long rectangle and cut into 2” squares. You will need 22 total.\n\nTake a piece of mozzarella cheese and wrap it with the cut dough. Form it into a ball and place it seam side down on the lined baking sheet. Repeat with the remaining dough and cheese pieces to form a tree shape.\n\nIn a small bowl, beat together the egg and water to make an egg wash.\nUse the pastry brush to cover the dough with the egg wash.\nBake until crust is golden brown, 18-20 minutes.\n\nIn a medium bowl, mix together the melted butter, garlic powder and rosemary until well combined.\nWhile warm, brush the topping generously on top of the pizza balls.\nSprinkle with parmesan, basil and parsley and red pepper flakes.\nServe warm with marinara sauce.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/60862403-7c75-49c8-8121-51e10c08ff53.png"],"url":"https://rosannapansino.com/blogs/recipes/pull-apart-tree-pizza","favorite":false,"rating":0.0,"lastModifiedDate":"2020-12-14 06:39:14","uuid":-1628002002,"originalPicture":"http://cdn.shopify.com/s/files/1/0163/5948/9636/articles/C63A4530_v2_F1SL_grande.jpg?v=1607135436","categories":[{"title":"Entree"},{"title":"Side"},{"title":"Pizza/Flammkuchen"}],"tags":[{"title":"vegetarian"},{"title":"Italian"},{"title":"milk protein"}],"keywords":"vegetarian;Italian;milk protein"},{"title":"Breadstick Bones","preparationTime":"10","cookingTime":"15","inactiveTime":"15","totalTime":"40","quantity":"6-8 sides","ingredients":"1 ¼ teaspoons active dry yeast\n¼ cup warm whole milk\n¼ cup warm water\n2 tablespoons sugar\n¼ cup mashed potatoes\n4 tablespoons unsalted butter, melted\n1 large egg\n1 cup all-purpose flour\n1 ¼ cups bread flour\n½ teaspoon garlic powder\n2 teaspoons salt\n1 tablespoon olive oil, for coating the bowl and dough\n\n[TOPPINGS]\n4 tablespoons unsalted butter, melted\n1 teaspoon garlic powder\n½ cup asiago cheese","instructions":"\nMake the dough: In the bowl of a stand mixer, whisk together the yeast, milk, water, and sugar. Set aside until foamy, about 10 minutes.\nOnce foamy, stir in the mashed potatoes, melted butter, and egg.\nIn a medium bowl, whisk together the all-purpose flour, bread flour, and garlic powder.\nStir ½ cup of the flour mixture into the yeast mixture until a thick paste forms.\nWith the mixer on low speed, beat in the salt and the remaining flour mixture, ¼ cup at a time. Mix until the dough is soft and pulls away from the sides of the bowl, 3 to 5 minutes.\nOn a lightly floured surface, knead the dough for an additional minute. Then form into a large ball. If the dough is too sticky, add more flour as needed.\nGrease a large bowl with the olive oil and place the dough inside. Roll the dough in the oil to completely coat. Cover the bowl with a clean cloth and let rest at room temperature until doubled in size, 1 to 2 hours.\nPreheat the oven to 350F. Line 2 baking sheets with parchment paper and lightly grease the paper.\nOn a lightly floured surface, divide the dough into 18 portions and shape each portion into a ball. Keep the dough covered with a clean cloth to prevent a skin from forming.\nRoll the balls into 4-inch ropes with a bulge at each end. Place on the baking sheets.\nCut the ends of the breadsticks to create bone details.\nCover the breadsticks with a clean cloth and let rest for 15 minutes.\nBake the bones until golden brown, 12 to 14 minutes.\nMake the topping: In a small bowl, stir together the melted butter and garlic powder.\nBrush the garlic butter onto the warm breadsticks and sprinkle with the Asiago.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/16bc6278-0f0a-420a-86fc-def20a983f40.png"],"url":"https://rosannapansino.com/blogs/recipes/breadstick-bones","favorite":false,"rating":0.0,"lastModifiedDate":"2020-12-14 06:41:39","uuid":-746601480,"originalPicture":"http://cdn.shopify.com/s/files/1/0163/5948/9636/articles/30_Breadstick_Bones_63aada67-57a4-4abe-85cb-7326b303f975_grande.jpg?v=1603841889","categories":[{"title":"Side"},{"title":"Dough"}],"tags":[{"title":"vegetarian"},{"title":"Italian"}],"keywords":"vegetarian;Italian"},{"title":"Peanut Butter Dog Biscuits","preparationTime":"10","cookingTime":"18","totalTime":"28","ingredients":"2 1/2 cups oat flour\n1 cup peanut butter\n2 tablespoons honey\n1 teaspoon baking powder\n1 cup water\n1 egg","instructions":"Preheat the oven to 350°F, and line a baking sheet with parchment paper\nIn a large mixing bowl, combine the flour, egg and baking powder.\nThen add the water, peanut butter and honey and mix until well combined.\nOn floured surface, roll out dough to ½” thick.\nCut out biscuits with bone cookie cutter and place on baking sheet. Poke holes in center for extra detail.\nBake until firm, about 18 minutes","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/09b4c662-6ba3-4a05-8a7c-42143311f4c2.png"],"url":"https://rosannapansino.com/blogs/recipes/peanut-butter-dog-biscuits","favorite":false,"rating":0.0,"lastModifiedDate":"2020-12-14 06:42:53","uuid":1657871921,"originalPicture":"http://cdn.shopify.com/s/files/1/0163/5948/9636/articles/Dog_Biscuits_with_Wilton_Cookie_Cutter_grande.jpg?v=1597882330","categories":[{"title":"Dog"}]},{"title":"Scooby Snacks from Scooby Doo","preparationTime":"10","cookingTime":"18","totalTime":"28","ingredients":"2 1/2 cups whole wheat organic flour\n1 egg\n1 teaspoon baking powder\n1 cup water\n2 tablespoons honey\n1 cup peanut butter\n1/4 teaspoon vanilla extract","instructions":"Preheat the oven to 350F.\nIn a large bowl, mix together the wheat flour, egg and baking powder.\nAdd in the water, peanut butter, honey and vanilla extract. Mix together until well combined.\nOn a flat surface, sprinkle some flour and roll the dough to 1/8\" thick.\nPlace the plastic wrap on top of the dough. \nCut out the cookies using the cookie cutter.\nRemove the plastic wrap.\nTransfer the cookies on a baking sheet.\nBake in the oven for 18 minutes. Let it cool completely.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/ecd94c02-a467-4104-a3eb-3c07755ee768.png"],"url":"https://rosannapansino.com/blogs/recipes/scooby-snacks","favorite":false,"rating":0.0,"lastModifiedDate":"2020-12-14 06:44:36","uuid":-1189356433,"originalPicture":"http://cdn.shopify.com/s/files/1/0163/5948/9636/articles/Scooby_Snacks_Plate_3_1_grande.jpg?v=1590853250","categories":[{"title":"Dog"}]},{"title":"Best Prime Rib (Garlic Herb Crust)","description":"This is the best prime rib recipe with a garlic herb crust - the perfect holiday standing rib roast! Watch the video above to see how I make it.","preparationTime":"15","cookingTime":"90","totalTime":"105","quantity":"8","ingredients":"6 pounds prime rib (bone-in (with bones cut off and tied back on))\n1/2 cup butter (softened)\n6 garlic cloves (minced)\n1 tablespoon kosher salt\n1 teaspoon finely chopped fresh thyme\n1 teaspoon finely chopped fresh rosemary\n1 teaspoon black pepper\n1 onion (quartered (if making the red wine au jus))\n1/4 cup drippings from prime rib pan (make sure to separate the fat from the drippings)\n2 cups beef broth\n1 1/2 cups red wine\nOptional: 1 tablespoon cornstarch or arrowroot powder (in a slurry) to thicken","instructions":"Prime Rib\n\nRemove the prime rib from the fridge 2-3 hours before cooking, and allow it to come to room temperature.\n\nPreheat your oven to 450F/230C. In a small bowl, mix together the butter, salt, thyme, rosemary, and black pepper.\n\nAfter the prime rib has come to room temperature, pat it down with paper towels to make sure it's dry. Then rub the entire outside of the prime rib with the herb butter mixture.\n\nPlace the prime rib in an oven-safe pan or roasting tray with the bones-side down, fat-side up. Place the onion slices in the pan around the meat, if you're making the red wine au jus. If not, you can omit the onions.\n\nCook the prime rib in the center of the oven for 20 minutes at 450F. It should get a nice sear on the outside. If not, cook it a few minutes longer. Then reduce the temperature of the oven to 325F and continue cooking until the internal temperature reaches 120F (about an hour and a half), for medium-rare. But go by temperature, not time, as it will depend on the size of your prime rib and your oven.\n\nRemove the prime rib from the oven and let it rest for 20-30 minutes. You can tent it with aluminum foil to keep it warm. Then, remove the string and bones, and slice it up into thick 1/2\" slices.\n\nRed Wine Au Jus\n\nAfter you've removed the fat from the pan, add up to 1/4 cup of drippings back in along with the beef broth and red wine. If you have leftover herbs, you can toss those in as well.\n\nSimmer this for about 15 minutes, or until the liquid has reduced by half. It's meant to be a thin sauce, but if you'd like to add a little bit of a thickener, you can do that as well. Strain the au jus to remove the onion and any browned bits, then drizzle over the prime rib.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/cb00d87f-60fd-40f1-9870-b13531ebd54e.png"],"url":"https://downshiftology.com/recipes/best-prime-rib/","nutrition":"calories : 1129 kcal\ncarbohydrate : 3 g\nprotein : 47 g\nfat : 100 g\nsaturatedFat : 43 g\ncholesterol : 225 mg\nsodium : 1193 mg\nfiber : 1 g\nsugar : 1 g\nservingSize : 1 serving","favorite":false,"rating":0.0,"lastModifiedDate":"2020-12-14 06:51:41","uuid":933706621,"originalPicture":"https://i2.wp.com/www.downshiftology.com/wp-content/uploads/2020/12/Prime-Rib-10.jpg","categories":[{"title":"Entree"}],"tags":[{"title":"beef"},{"title":"holiday"},{"title":"comfort food"},{"title":"British"},{"title":"dutch oven"}],"keywords":"beef;holiday;comfort food;British;dutch oven"},{"title":"Hot Chocolate","description":"This is hands down the best hot chocolate you'll ever taste! It's unbelievably rich, velvety smooth, and perfect for warming up throughout the winter season.","preparationTime":"5","cookingTime":"5","totalTime":"10","quantity":"4","ingredients":"4 cups milk (dairy or dairy-free (any type will work))\n3 tablespoons cacao powder\n2 tablespoons maple syrup (or honey)\n4 ounces semi-sweet chocolate (finely chopped (or approx 2/3 cup chocolate chips))\nOptional: 1/2 teaspoon of vanilla extract","instructions":"In a saucepan over medium heat, bring the milk, cacao powder, and maple syrup to a simmer. Stir until there's no clumps.\n\nAdd the finely chopped chocolate and whisk for about 3-5 minutes, or until the hot chocolate is smooth.\n\nPour the hot chocolate into mugs, and if you'd like, top with whipped cream, coconut whipped cream or homemade marshmallows and a sprinkle of cacao powder.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/a5c7e026-a6be-47a8-a748-1aab5c206df1.png"],"url":"https://downshiftology.com/recipes/best-hot-chocolate/","nutrition":"calories : 225 kcal\ncarbohydrate : 25 g\nprotein : 2 g\nfat : 13 g\nsaturatedFat : 7 g\ncholesterol : 2 mg\nsodium : 165 mg\nfiber : 4 g\nsugar : 16 g\nservingSize : 1 serving","favorite":false,"rating":0.0,"lastModifiedDate":"2020-12-14 06:46:19","uuid":1410921504,"originalPicture":"https://i2.wp.com/www.downshiftology.com/wp-content/uploads/2020/11/Hot-Chocolate-7.jpg","categories":[{"title":"Drink"}],"tags":[{"title":"holiday"},{"title":"comfort food"},{"title":"Christmas"}],"keywords":"holiday;comfort food;Christmas"},{"title":"Thanksgiving Turkey","description":"This is the BEST Thanksgiving turkey recipe. You don't need to brine and you don't need to baste. Just a few simple steps and you'll have a perfectly golden, juicy, and insanely flavorful roasted turkey that'll impress your family and guests. Watch the video above!","preparationTime":"30","cookingTime":"210","totalTime":"240","quantity":"14","ingredients":"1 12-18 pound turkey (*see notes below about using a larger turkey) (fully thawed)\n1 onion (peeled and quartered)\n1 lemon (quartered)\n1-2 sprig fresh rosemary\n1-2 sprig fresh thyme\n1-2 sprig fresh sage\nsalt and pepper\n3/4 cup unsalted butter (room temperature)\n6 cloves garlic (minced)\n1 teaspoon salt\n1/2 teaspoon black pepper\n1 tablespoon fresh rosemary (finely chopped)\n1 tablespoon fresh thyme (finely chopped)\n1 onion (peeled and quartered)\n3 ribs celery (roughly chopped)\n2 carrots (roughly chopped)","instructions":"Allow your turkey to come to room temperature by removing it from the fridge 1 hour before roasting. Then, remove the giblets.\n\nPreheat your oven to 325F/160C and pat the outside of the turkey dry with paper towels. Season the cavity of the turkey with salt and pepper. Then fill it with the onion, lemon, and fresh herbs. If your turkey is smaller, don't overfill the cavity as you do want some airflow.\n\nMake the herb butter by stirring together the softened butter, garlic, salt, pepper, rosemary and thyme in a small bowl.\n\nThen, loosen the skin of the turkey gently by sliding your fingers underneath. Then rub about 1/3 of the herb butter between the skin and turkey breasts.\n\nRub the remaining herb butter all over the entire outside of the turkey.\n\nPlace the turkey on a roasting rack or on top of a bed of vegetables (if you don't have a rack), or both! Tuck the wing tips under the turkey to prevent them from burning.\n\nPlace the turkey in the oven and roast for about 15 minutes per pound, or until the internal temperature reaches 158-160F. You don't need to baste the turkey, but do keep an eye on it after it's about 75% done. If you notice the skin browning too quickly, you can place aluminum foil on top. To verify the temperature, place a thermometer into the meatiest part of the thigh or breast. The turkey will continue to cook once it's removed from the oven and will rise in temperature to 165F, after it's rested.\n\nLet the turkey to rest for 30 minutes before carving. This allows the juices to redistribute, making for a deliciously juicy turkey. To keep the turkey warm, you can cover the turkey with aluminum foil on the counter.\n\nCarve and serve the turkey. And make sure to save the juices from the pan to make turkey gravy!","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/509602c6-3954-4ae3-9411-a61c73742f15.png"],"url":"https://downshiftology.com/recipes/thanksgiving-turkey-recipe/","nutrition":"calories : 104 kcal\ncarbohydrate : 4 g\nprotein : 1 g\nfat : 10 g\nsaturatedFat : 6 g\ncholesterol : 26 mg\nsodium : 182 mg\nfiber : 1 g\nsugar : 1 g\nservingSize : 1 serving","favorite":false,"rating":0.0,"lastModifiedDate":"2020-12-14 06:47:14","uuid":-2047022253,"originalPicture":"https://i2.wp.com/www.downshiftology.com/wp-content/uploads/2020/11/Turkey-Recipe-16.jpg","categories":[{"title":"Entree"}],"tags":[{"title":"poultry"},{"title":"holiday"},{"title":"Thanksgiving"}],"keywords":"poultry;holiday;Thanksgiving"},{"title":"Maple Orange Glazed Spatchcock Turkey","description":"This maple orange glazed spatchcock turkey is here to steal the Thanksgiving spotlight! It's juicy, sweet, citrusy, and perfectly crispy.","preparationTime":"30","cookingTime":"90","totalTime":"150","quantity":"12","ingredients":"12 pound turkey\n3/4 cup butter (cubed and softened at room temperature)\n4 garlic cloves (minced)\n1 tablespoon finely chopped fresh thyme\n1 large onion (sliced)\n2 oranges (sliced)\nsalt and pepper (to taste)\n1/3 cup orange juice\n1/3 cup maple syrup","instructions":"To spatchcock your turkey, place the turkey breast side down and cut alongside both sides of the backbone to remove it.\n\nOpen up the turkey and score along the keel bone to make it easier to flatten.\n\nFlip the turkey breast side up and push down with your hands to flatten it.\n\nPreheat your oven to 425F. In a measuring cup, mix the orange juice and maple syrup together and set aside. Then, make the herb butter by mixing the butter, minced garlic, thyme, salt and pepper in a small bowl.\n\nUse your hands to gently loosen the skin of the turkey on top of the breasts. Rub 1/3 of the herb butter under the skin. Then rub the remaining herb butter on the outside of the turkey.\n\nAdd the slices of onion and orange on a baking sheet or roasting pan, then lay the spatchcock turkey on top. Tuck the wing tips under.\n\nPlace your turkey in the oven and reduce the oven temperature to 350F. Roast the turkey for 30 minutes, then pour the maple orange juice mixture all over the turkey. Continue roasting the turkey for another hour, or until the internal temperature is 160F, and baste the turkey with the maple orange glaze every 20 minutes. Remove the turkey from the oven, let it rest for at least 30 minutes, then carve and serve.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/c1173910-1cb9-490b-a654-e5f3df5cebed.png"],"url":"https://downshiftology.com/recipes/maple-orange-glazed-spatchcock-turkey/","nutrition":"calories : 600 kcal\ncarbohydrate : 11 g\nprotein : 70 g\nfat : 30 g\nsaturatedFat : 12 g\ncholesterol : 262 mg\nsodium : 464 mg\nfiber : 1 g\nsugar : 9 g\nservingSize : 1 serving","favorite":false,"rating":0.0,"lastModifiedDate":"2020-12-14 06:47:48","uuid":881218481,"originalPicture":"https://i2.wp.com/www.downshiftology.com/wp-content/uploads/2020/11/Maple-Orange-Glazed-Spatchcock-Turkey-16.jpg","categories":[{"title":"Entree"}],"tags":[{"title":"poultry"},{"title":"holiday"},{"title":"Thanksgiving"}],"keywords":"poultry;holiday;Thanksgiving"},{"title":"Sake Mojito","description":"Refreshing sake mojito with crushed mint and a splash of lime, perfect for that warm day in the backyard. ","preparationTime":"5","totalTime":"5","quantity":"1","ingredients":"6 mint leaves ((fresh))\n1 tsp sugar\n½ lime ((cut into small pieces))\n5 oz sake\nIce\n3 oz club soda\n1 sprig mint","instructions":"In a cocktail shaker, crush 6 fresh mint leaves, 1 tsp. granulated sugar, and lime.\n\nAdd and shake with 5 oz sake.\n\nStrain liquid into a glass filled with ice.\n\nTop with 1 oz club soda and 1 sprig of mint.","pictures":["/storage/emulated/0/Android/data/fr.recettetek/files/images/2ab4210a-2fcd-4321-8f3d-b151bf607361.png"],"url":"https://www.justonecookbook.com/sake-mojito-guest-post-by-family-spice/","favorite":false,"rating":3.5,"lastModifiedDate":"2020-12-14 06:50:11","uuid":195848236,"originalPicture":"https://www.justonecookbook.com/wp-content/uploads/2012/03/Sake-Mojito.jpg","categories":[{"title":"Drink"}],"tags":[{"title":"Mexican"},{"title":"sake"}],"keywords":"Mexican;sake"}]